/** @jsxImportSource @emotion/react */
import * as React from "react";
import {  Text,} from "customize-easy-ui-component";
import {CCell, FlexibleTable, TableBody, TableHeader, TableRow} from "@/components/flexible-table";
import {crtOmni, omniCalculateDefault, pushOmni} from "../../common/omni";
import {JumpMeasure, } from "../../common/general";
//id标签需要规范原来5.1的改为T5-1的才能路由。
export const setupItemAreaRoute= ({rep, orc, noDefault} :{rep:any,orc?:any,noDefault?:boolean}
) => {
    let ari: any[] =[];
    pushOmni(ari,'1.1',[
        crtOmni('许可证',{big:'K1资料审查',bspan:11,span:2,seco:'※K1.1特种设备生产许可证',},{seco:'※K1.1' },
            <Text>(1)制造、安装、改造或者修理单位的相关许可证件，应符合许可证的范围，有效期应符合要求。
            </Text>, {nos:'1.1(1)',pre:'※', mergLabel:'特种设备生产许可证'},true, '（1）特种设备生产许可证',),
        crtOmni('施工告知',{},undefined,
            <Text>(2)应按照要求办理施工告知手续。
            </Text>, {nos:'1.1(2)',pre:'※', mergNos:'1.1',mergName:'生产许可',},false, '（2）施工告知',),
        crtOmni('出厂文件',{span:3,seco:'K1.2产品资料',},{seco:'K1.2' },
            <Text>(1)出厂文件和资料、主要受力部件材料证明、标准机电产品合格证明、产品质量证明、设备自检报告、设备运行试验记录应齐全。
            </Text>, {nos:'1.2(1)', mergLabel:'产品资料'},true, '（1）出厂文件和资料',),
        crtOmni('型式试验',{},undefined,
            <Text>(2)※设计文件鉴定、型式试验报告及证书，应覆盖监督检验的大型游乐设施。
            </Text>, {nos:'1.2(2)', },true, '（2）设计文件鉴定、型式试验报告及证书',),
        crtOmni('设计变更',{},undefined,
            <Text>(3)设计一致性或者设计变更说明，以及设计变更资料应符合规定。
            </Text>, {nos:'1.2(3)', mergNos:'1.2',mergName:'产品资料',},false, '（3）设计一致性或者变更说明',),
        crtOmni('施工文件',{seco:'K1.3',},undefined,
            <Text>(1)施工作业（工艺）文件应经施工单位技术负责人批准，内容包括作业程序、技术要求、方法和措施。
            </Text>, {nos:'1.3',},false,'施工文件'),
        crtOmni('基础验收',{seco:'K1.4',},undefined,
            <Text>(1)应有经过施工单位盖章确认的基础验收合格证明。
            </Text>, {nos:'1.4',},false,'基础验收资料'),
        crtOmni('自检报告',{seco:'K1.5',},undefined,
            <Text>(1)施工单位各项施工应有自检报告，并且有自检人员签字确认。
            </Text>, {nos:'1.5',},false,'自检报告'),
        crtOmni('无损报',{span:2,seco:'※K1.8无损检测报告',},{seco:'※K1.8',},
            <Text>(1)审查主要受力部件和重要焊缝无损检测报告，图纸和工艺文件规定的零部件、部位应按照规定方法与比例进行检测。
            </Text>, {nos:'1.8(1)',pre:'※', mergLabel:'无损检测报告'},true, '（1）无损检测报告',),
        crtOmni('无损检资',{},undefined,
            <Text>(2)无损检测人员及第三方无损检测单位（如涉及）应具有特种设备无损检测资格。
            </Text>, {nos:'1.8(2)',pre:'※', mergNos:'1.8',mergName:'无损检',},false, '（2）无损检测资格',),
        crtOmni('安保资料',{seco:'※K1.9',},undefined,
            <Text>(1)审查相关资料、特种设备及安全附件的使用手续、定期检验报告、校验报告，其应符合相应设备的要求。
            </Text>, {nos:'1.9',pre:'※',},false,'其他特种设备、安全附件及安全保护装置资料'),
    ],'1.1生产许可证-1.9安全附件及安全保护装置资料');
    pushOmni(ari,'2.1',[
        crtOmni('铭牌',{big:'K2机械与结构检验',bspan:11,span:2,seco:'K2.1产品铭牌与乘客须知',}, {seco:'K2.1',},
            <Text>(1)设备显著位置应固定产品铭牌，产品铭牌内容至少包括制造单位名称与制造地址、特种设备生产许可证号、设备类别和型式、产品编号、制造日期、主要技术参数。
            </Text>, {nos:'2.1(1)', mergLabel:'产品铭牌与乘客须知'},true, '（1）产品铭牌',),
        crtOmni('须知',{},undefined,
            <Text>(2)乘客须知内容、配置位置应符合使用维护保养说明书的要求和实际情况。
            </Text>, {nos:'2.1(2)', mergNos:'2.1',mergName:'乘客须知',},false, '（2）乘客须知',),
        crtOmni('基础',{seco:'K2.2',},undefined,
            <Text>(1)基础与设备的连接方式应符合设计文件要求，基础无影响设备正常运行的不均匀沉降、开裂，移动式设备基础应符合使用维护保养说明书规定。
            </Text>, {nos:'2.2',},false,'基础'),
        crtOmni('地脚螺栓',{seco:'K2.3',},undefined,
            <Text>(1)地脚螺栓连接应有防松措施和防松标识；防松措施类型应符合设计文件要求；地脚螺栓应无松动、严重腐蚀。
            </Text>, {nos:'2.3',},false,'地脚螺栓'),
        crtOmni('主受力件',{seco:'K2.4',},undefined,
            <Text>(1)结构型式、所用材料、焊缝布置、连接等应符合设计文件要求；表面质量不应存在严重腐蚀、磨损、弯曲、变形等缺陷，结构件的最大锈蚀深度应当小于原型钢厚度的15%。
                <JumpMeasure tag={'Measure'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'2.4',},false,'主要受力部件'),
        crtOmni('重要轴',{seco:'K2.5',},undefined,
            <Text>(1)重要轴（销轴）材料、热处理、硬度、加工圆角、几何尺寸偏差等应符合设计文件要求。
            </Text>, {nos:'2.5',},false,'重要轴（销轴）材料、表面硬度及加工尺寸'),
        crtOmni('轴磨损',{seco:'K2.6',},undefined,
            <Text>(1)磨损量和锈蚀量应符合维护保养说明书及以下要求，重要轴（销轴）最大磨损量应当小于原直径的0.8%，且最大值不超过1mm；重要轴（销轴）的锈蚀量(经打磨后)，应当小于原直径的1%(包括
                凹坑处），且最大不超过1mm。
                <JumpMeasure tag={'Measure'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'2.6',},false,'重要轴（销轴）磨损和锈蚀'),
        crtOmni('隐蔽件',{seco:'K2.7',},undefined,
            <Text>(1)隐蔽件的结构型式应符合设计文件要求。
            </Text>, {nos:'2.7',},false,'隐蔽件'),
        crtOmni('螺栓连接',{seco:'K2.8',},undefined,
            <Text>(1)重要螺栓、重要轴(销轴)连接选型应符合设计文件要求，重要螺栓应无松动现象，重要轴（销轴）不应存在脱落风险。
            </Text>, {nos:'2.8',},false,'重要螺栓、重要轴（销轴）连接'),
        crtOmni('焊缝表面',{seco:'K2.9',},undefined,
            <Text>(1)焊缝表面及热影响区表面不应当存在漏焊、烧穿、裂纹、未焊透、密集气孔、塌陷、严重咬边、未焊满、夹渣等外观缺陷。
            </Text>, {nos:'2.9',},false,'焊缝表面质量'),
        crtOmni('焊缝无损',{seco:'※K2.10',},undefined,
            <Text>(1)受检单位无损检测应按照设计文件要求或者使用维护保养说明书规定进行并检测合格，可通过资料审查或者对重要轴(销轴)、重要焊缝进行表面无损检测抽查进行。对A级大型游乐设施重要轴（销
                轴）、重要焊缝进行不少于20%的表面无损检测抽查；对于延长使用期限的，进行不少于30%的表面无损检测抽查。
            </Text>, {nos:'2.10',pre:'※',},false,'重要焊缝和重要轴（销轴）无损检测'),
    ],'2.1铭牌-2.10重要焊缝和重要轴无损检测');
    //"sk":[ {"no":"2.12.1","r":0,"bs":[5],"ss":[5],"ts":[1]}, 0, {"pr":"※","r":0},0,0
    pushOmni(ari,'2.12',[
        crtOmni('轨道支柱',{bspan:5,span:5,seco:'K2.12轨道',third:'K2.12.1',tspan:1,},undefined,
            <Text>(1)支柱不应承受设计文件要求以外的外加载荷。
            </Text>, {nos:'2.12.1',},false,'轨道支柱'),
        crtOmni('轨道晃动',{third:'K2.12.2',},undefined,
            <Text>(1)轨道不应有异常的晃动现象。
            </Text>, {nos:'2.12.2',},false,'轨道晃动情况'),
        crtOmni('轨道磨损',{third:'※K2.12.3',},undefined,
            <Text>(1)型钢轨道磨损量应当小于原厚度尺寸的20%； 钢管轨道磨损量应当小于原钢管壁厚的15%。
            </Text>, {nos:'2.12.3',pre:'※',},false,'轨道磨损情况'),
        crtOmni('轨距误差',{third:'K2.12.4',},undefined,
            <Text>(1)轨矩误差应符合设计文件及以下要求。侧轮在轨道内时轨距允许误差为-3mm～5mm,侧轮在轨道外时轨距允许误差为-5mm～3mm,木制轨道轨距允许误差为-5mm～6mm，
                不同曲率半径轨道应当过渡平顺，保证车辆运行平稳。
            </Text>, {nos:'2.12.4',},false,'轨距误差'),
        crtOmni('轨平圆滑',{third:'K2.12.5',},undefined,
            <Text>(1)轨道对接方式、轨道表面平整情况和曲线轨道过渡圆滑情况应符合要求，无明显冲击现象，轨道接口应当平滑过渡，轨道与车轮接触面的接口处高低差应当不大于1 mm。
            </Text>, {nos:'2.12.5',},false,'轨道表面平整情况和曲线轨道过渡圆滑情况'),
    ],'2.12.1轨道支柱-2.12.5轨道表面平整和圆滑情况');
    //"sk":[ {"no":"3.1","r":0,"bs":[9],"ss":[1]}, 0,0,0, {"no":"3.5.1","r":0,"ss":[5],"ts":[1]},0,0, {"pr":"※","no":"3.5.4","r":0},0
    pushOmni(ari,'3.1',[
        crtOmni('液压系统',{big:'K3传动系统检验',bspan:9,span:1,seco:'K3.1',},undefined,
            <Text>(1)液压（气动）系统应符合设计文件要求；液压（气动）系统运转正常。
            </Text>, {nos:'3.1',},false,'液压（气动）系统装置'),
        crtOmni('齿轮传动',{seco:'K3.2',},undefined,
            <Text>(1)齿轮应无偏啮合及偏磨损情况。
            </Text>, {nos:'3.2',},false,'齿轮传动'),
        crtOmni('皮带传动',{seco:'K3.3',},undefined,
            <Text>(1)采用皮带或者链传动时，应当设置可调整皮带或者链条的张紧机构。皮带和链传动应当拉紧适度；皮带应当无破损、老化、断裂，皮带连接部无伤痕、剥离；皮带传动工作时不应当有明显的打
                滑和跑偏等异常现象；链传动不应当出现脱链、跳齿及影响使用的松边颤振等现象。
            </Text>, {nos:'3.3',},false,'皮带和滚子链传动'),
        crtOmni('转向机构',{seco:'K3.4',},undefined,
            <Text>(1)转向机构应灵活、可靠，无卡滞现象。
            </Text>, {nos:'3.4',},false,'转向机构'),
        crtOmni('端部固定',{seco:'K3.5乘人部分钢丝绳',span:5,third:'K3.5.1',tspan:1,},undefined,
            <Text>(1)钢丝绳端部固定所采取的方式应有效。
            </Text>, {nos:'3.5.1',},false,'钢丝绳端部固定'),
        crtOmni('轮绳径比',{third:'K3.5.2',},undefined,
            <Text>(1)提升乘人装置用的卷筒、滑轮直径与钢丝绳直径之比应当不小于30；钢丝绳对滑轮包角不大于90°时，滑轮直径与钢丝绳直径之比应当不小于20。
                <JumpMeasure tag={'Measure'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'3.5.2',},false,'卷筒、滑轮直径与钢丝绳直径之比'),
        crtOmni('绳防过卷',{third:'K3.5.3',},undefined,
            <Text>(1)提升钢丝绳应装有限位或者其他防止钢丝绳过卷、松弛装置，卷筒上应留有一定的余量。
            </Text>, {nos:'3.5.3',},false,'钢丝绳防过卷、松弛装置'),
        crtOmni('防脱落',{third:'※K3.5.4',},undefined,
            <Text>(1)应设置防止钢丝绳从滑轮上脱落和跳槽的结构，防脱落装置应可靠。
            </Text>, {nos:'3.5.4',pre:'※',},false,'防止脱落装置'),
        crtOmni('绳断丝',{third:'K3.5.5',},undefined,
            <Text>传动和提升用钢丝绳断丝、磨损等缺陷应当符合相关国家或者行业标准要求。传动和提升用钢丝绳出现下列情况之一的,应报废:
                a)传动和提升用钢丝绳的断丝和磨损超过允许值时(见下表)； b)整根绳股断裂；
                c)钢丝绳的纤维芯或钢丝(或多层绳股的内部绳股)断裂,造成绳股显著减小时； d)由于外部腐蚀钢丝绳表面出现深坑，钢丝绳相当松弛时；
                e)经确认有严重的内部腐蚀时； f)出现笼形畸变时；
                g)绳股被挤出，这种状况通常伴随笼形畸变产生； h)局部直径严重增大或减小时；
                i)局部弯折、扭结或被压扁时； j)受特殊热力的作用，外表出现可识别的颜色时；
                k)超过设计及有关技术规程规定的使用寿命时。
                <FlexibleTable columnWidths={ ["%","43%"] } css={{borderCollapse: 'collapse'}} ><TableBody>
                    <TableRow><CCell>磨损状态</CCell><CCell>允许值</CCell></TableRow>
                    <TableRow><CCell>钢丝破断呈均匀分布状态</CCell><CCell>每股在一个捻距内破断数为3根</CCell></TableRow>
                    <TableRow><CCell>钢丝破断虽呈均匀分布状态，钢丝磨损后的剩余断面积为原断面积的80%以下或严重腐蚀</CCell><CCell>每股在一个捻距内破断数为2根</CCell></TableRow>
                    <TableRow><CCell>钢丝在一处破断或特别集中在一股时</CCell><CCell>钢丝破断总数在一个捻距内，6股为10根，8股为12根</CCell></TableRow>
                    <TableRow><CCell>磨损后的钢丝绳直径</CCell><CCell>为原钢丝绳直径的90%以上</CCell></TableRow>
                </TableBody></FlexibleTable>
                <JumpMeasure tag={'Measure'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'3.5.5',},false,'钢丝绳断丝、磨损缺陷'),
    ],'3.1液压（气动）系统-3.5.5钢丝绳断丝磨损');
    pushOmni(ari,'3.6.1',[
        crtOmni('提升系统',{bspan:6,seco:'K3.6乘人部分提升系统',span:4,third:'K3.6.1',tspan:1,},undefined,
            <Text>(1)提升系统运行时不应有异常声响和冲击振动。
            </Text>, {nos:'3.6.1',},false,'提升系统基本要求'),
        crtOmni('提升链条',{third:'K3.6.2',},undefined,
            <Text>(1)提升链条拉紧应适度。
            </Text>, {nos:'3.6.2',},false,'提升链条'),
        crtOmni('提升皮带',{third:'K3.6.3',},undefined,
            <Text>(1)提升皮带应装设有张紧装置、皮带松紧应适度，不会产生明显的损伤和跑偏。
            </Text>, {nos:'3.6.3',},false,'提升皮带'),
        crtOmni('导向装置',{third:'K3.6.4',},undefined,
            <Text>(1)导向装置应灵活可靠。
            </Text>, {nos:'3.6.4',},false,'导向装置'),
        crtOmni('油缸保险',{span:1,seco:'K3.7',},undefined,
            <Text>(1)乘人部分油（气）缸应有保险装置。
            </Text>, {nos:'3.7',},false,'乘人部分油（气）缸保险装置'),
        crtOmni('车轮磨损',{span:1,seco:'K3.8※',},undefined,
            <Text>(1)滑行车类设备主车轮、侧轮和底轮的磨损量应符合设计文件要求。滑行车车轮的磨损量应当小于原直径尺寸的2.5%，且主车轮最大磨损量不超过6mm，侧轮和底轮最大磨损量不超过4mm。
            </Text>, {nos:'3.8',pre:'※',},false,'车轮磨损'),
    ],'3.6.1提升系统-3.8车轮磨损');
    //"sk":[ {"no":"4.1","r":0,"bs":[7],"ss":[1]}, 0,0,{"pr":"※","r":0},{"no":"4.6","r":0},0,{"pr":"※","r":0}
    pushOmni(ari,'4.1',[
        crtOmni('电气安装',{big:'K4电气及控制系统检验',bspan:8,span:1,seco:'K4.1',},undefined,
            <Text>(1)电气设备应当安装牢固、完好。
            </Text>, {nos:'4.1',},false,'电气设备安装'),
        crtOmni('配电接地',{seco:'K4.2',},undefined,
            <Text>(1)低压配电系统的接地型式应当采用TN-S系统或者TN-C-S系统（使用独立变压器，供电距离短，对接地系统有特殊要求的设备，经安全分析能够满足安全使用要求的除外），且应符合设计文件要求。
            </Text>, {nos:'4.2',},false,'低压配电系统接地型式'),
        crtOmni('接地要求',{seco:'K4.3',},undefined,
            <Text>(1)电气设备中正常不带电的金属外壳、金属管槽、电缆金属保护层、互感器二次回路、变压器铁芯等应当可靠接地；低压配电系统保护接地电阻应当不大于10Ω。
            </Text>, {nos:'4.3',},false,'接地要求和接地电阻'),
        crtOmni('绝缘电阻',{seco:'※K4.4',},undefined,
            <Text>(1)电压有效值大于50V的带电回路与接地装置之间的绝缘电阻应当能保证用电安全，绝缘电阻应当不小于1MΩ。
                <JumpMeasure tag={'Measure'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'4.4',pre:'※',},false,'绝缘电阻'),
        crtOmni('轨绝缘',{seco:'K4.5',},undefined,
            <Text>(1)路轨与导电轨之间的绝缘电阻应当不小于0.1MΩ。
            </Text>, {nos:'4.5',},false,'路轨与导电轨间的绝缘电阻'),
        crtOmni('电机电流',{seco:'K4.6',},undefined,
            <Text>(1)满载或者偏载运转平稳后，电动机电流值应符合设计文件及以下要求，在满载和设计允许偏载的情况下，连续工作的异步电机工作电流应当不大于电机的额定电流。
            </Text>, {nos:'4.6',},false,'电动机电流'),
        crtOmni('控制系统',{seco:'K4.7',},undefined,
            <Text>(1)控制系统应符合设计文件要求。
            </Text>, {nos:'4.7',},false,'控制系统'),
        crtOmni('联锁控制',{seco:'※K4.8',},undefined,
            <Text>(1)采用自动控制或者联锁控制时，在维修(维护)模式下，每个运动应当可单独控制。有防止误起动的控制措施。
            </Text>, {nos:'4.8',pre:'※',},false,'自动控制或者联锁控制'),
    ],'4.1电气设备安装-4.8自动控制或者联锁控制');
    pushOmni(ari,'4.9',[
        crtOmni('按钮信号',{bspan:7,span:1,seco:'K4.9',},undefined,
            <Text>(1)控制元件与操作台按钮应完好，并有明确标志；操作按钮应有相应的信号响应，指示灯应按照标识指示。
            </Text>, {nos:'4.9',},false,'控制元件及操作按钮、信号灯等标志和颜色'),
        crtOmni('停止按钮',{seco:'※K4.10',},undefined,
            <Text>(1)紧急停止按钮应符合设计文件及以下要求，紧急停止按钮应当设置在乘客不易触及的区域，必要时应当加防护隔离罩；操作台上应当设置紧急停止按钮(必要时站台上也应当设置)，按钮型式应当采
                用凸起手动复位式，按下紧急停止按钮不应造成人员伤害。
            </Text>, {nos:'4.10',pre:'※',},false,'紧急停止按钮及按钮型式'),
        crtOmni('乘客开关',{seco:'K4.11',},undefined,
            <Text>(1)由乘客操作的电器开关的电压应当不高于24V,对于工作电压难以满足要求的设备，其结构和外壳应当对意外触及带电零部件有足够的防护。
            </Text>, {nos:'4.11',},false,'乘客操作电器开关'),
        crtOmni('照明电压',{seco:'K4.12',},undefined,
            <Text>(1)乘客易接触部位的装饰照明电压应当不大于50V。
            </Text>, {nos:'4.12',},false,'装饰照明电压'),
        crtOmni('应急照明',{seco:'K4.13',},undefined,
            <Text>(1)根据实际工况应当有相应照明和应急照明设备。
            </Text>, {nos:'4.13',},false,'照明和应急照明'),
        crtOmni('音响信号',{seco:'K4.14',},undefined,
            <Text>(1)音响等信号装置应有效。
            </Text>, {nos:'4.14',},false,'音响和信号装置'),
        crtOmni('余电保护',{seco:'K4.15',},undefined,
            <Text>(1)电气设备应有标牌。安装在水泵房、游泳池等潮湿场所的电气设备以及使用非安全电压的装饰及照明设备应设有剩余电流动作保护装置，其技术参数额定值应当与被保护线路或者设备的技术参数
                及安装与运行环境相匹配。
            </Text>, {nos:'4.15',},false,'潮湿场所电气设备剩余电流动作保护装置'),
    ],'4.9按钮、信号灯等标志-4.15潮湿场所电气设备保护');
    //"sk":[{"no":"5.1","r":3,"bs":[12],"ss":[3],"vx":1},0,0,{"pr":"※","no":"5.4.1","ss":[7],"ts":[1],"r":0},{"pr":"※","r":0},{"pr":"※","r":0},{"pr":"※","ts":[4],"r":4,"vx":1}
    //生成后手动给自拆分项目首行上加 mergLabel :'';改动+加{seco:' ' }；
    pushOmni(ari,'5.1',[
        crtOmni('乘人结构',{big:'K5乘载系统检验',bspan:12,span:3,seco:'K5.1结构',},{seco:'K5.1',},
            <Text>(1)乘人装置结构应符合设计文件要求。
            </Text>, {nos:'5.1(1)',mergLabel:'结构'},true, '（1）乘人装置结构',),
        crtOmni('玻璃钢连',{},undefined,
            <Text>(2)玻璃钢件与结构件直接连接时应当有足够的强度，否则需要预埋满足强度要求的金属件。
            </Text>, {nos:'5.1(2)', },true, '（2）玻璃钢件与结构件的连接',),
        crtOmni('玻璃',{},undefined,
            <Text>(3)座舱门窗玻璃应采用不易破碎的材料。
            </Text>, {nos:'5.1(3)', mergNos:'5.1',mergName:'结构',},false, '（3）座舱门窗玻璃采用的材料',),
        crtOmni('座席',{seco:'K5.2',},undefined,
            <Text>(1)抽查测量相关尺寸，座席型式和尺寸应符合设计文件及以下要求。座席距地面最大高度5m以下时,座舱深度不小于550mm,座席靠背高度不小于300mm。座席距地面最大高度5m以上时,座舱深度
                不小于800mm,座席靠背高度不小于400mm。当设有安全杠和安全带等设施时,可适当减少座舱深度。乘人座席宽度每人应不小于400mm，专供儿童乘坐的每人应不小于250mm。
                <JumpMeasure tag={'Measure'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'5.2',},false,'座席尺寸和型式'),
        crtOmni('尖角毛刺',{seco:'K5.3',},undefined,
            <Text>(1)乘客可能触及之处应无有外露的锐边、尖角、毛刺和危险突出物等。
            </Text>, {nos:'5.3',},false,'尖角毛刺和危险突出物'),
        crtOmni('安全带',{seco:'K5.4乘客束缚装置',span:7,third:'※K5.4.1',tspan:1,},undefined,
            <Text>(1)安全带应符合设计文件及以下要求：安全带织带的宽度应当不小于30mm，安全带破断拉力应当不小于6000N，安全带的宽度和破断拉力还应当满足实际工况下束缚乘客的安全性要求，并且有相
                应的合格证明文件或者检测报告；安全带卡扣组件、安全带卡扣组件与安全带连接的破断拉力应当不小于6000N，安全带卡扣组件应当锁紧可靠，在无外力作用的情况下应当不能自行打开；安全带
                与机体的连接应当牢固可靠。单车滑行车系列、多车滑行车系列、弯月飞车系列、架空游览车类（封闭座舱不作要求）大型游乐设施采用安全挡杆作为主要束缚装置时只能由操作人员释放。
                <JumpMeasure tag={'Measure2'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'5.4.1',pre:'※',},false,'安全带'),
        crtOmni('安全把手',{third:'※K5.4.2',},undefined,
            <Text>(1)安全把手固定应牢固。
            </Text>, {nos:'5.4.2',pre:'※',},false,'安全把手'),
        crtOmni('安全挡杆',{third:'※K5.4.3',},undefined,
            <Text>(1)安全挡杆应能够规范乘客的乘坐姿势，其锁紧装置应符合设计文件要求。单车滑行车系列、多车滑行车系列、弯月飞车系列、架空游览车类（封闭座舱不作要求）大型游乐设施采用安全挡杆作为
                主要束缚装置时，乘客应当不能自行打开安全挡杆。
            </Text>, {nos:'5.4.3',pre:'※',},false,'安全挡杆'),
        crtOmni('压杠资料',{third:'※K5.4.4安全压杠',tspan:4,}, {third:'※K5.4.4'},
            <Text>(1)应有试验报告等相关资料和自检报告。
            </Text>, {nos:'5.4.4(1)',pre:'※',mergLabel:'安全压杠' },true, '（1）安全压杠资料',),
        crtOmni('被乘客开',{},undefined,
            <Text>(2)安全压杠在运行中不能自行开锁或者不会被乘客打开。
            </Text>, {nos:'5.4.4(2)',pre:'※', },true, '（2）运行中不能自行开锁或者不会被乘客打开',),
        crtOmni('压杠锁紧',{},undefined,
            <Text>(3)安全压杠及其锁紧装置应有效，安全压杆在压紧状态时端部游动量应符合设计文件要求。
            </Text>, {nos:'5.4.4(3)',pre:'※', },true, '（3）锁紧装置',),
        crtOmni('压杠联锁',{},undefined,
            <Text>(4)具有自动联锁功能的，在自动运行模式下，分别单独触发闭合或者锁紧，起动按钮应不能起动设备；具有人工联锁功能的，站台应有人工确认按钮，并且在自动运行模式下不触发人工确认按钮，
                起动按钮应不能起动设备。
            </Text>, {nos:'5.4.4(4)',pre:'※', mergNos:'5.4.4',mergName:'压杠',},false, '（4）联锁功能',),
    ],'5.1乘人装置结构-5.4.4安全压杠联锁');
    pushOmni(ari,'5.5.1',[
        crtOmni('安全距',{bspan:3,span:3,seco:'K5.5安全距离和防护',third:'※K5.5.1',tspan:1,},undefined,
            <Text>(1)乘人部分与障碍物最近距离应符合设计文件及以下要求，凡乘客身体可伸到座舱以外时，应当设有防止乘客在运行中与周围障碍物相碰撞的安全保护装置或者留出足够的安全距离，防止乘客发生
                碰撞危险；运行速度较低时，安全距离可适当降低。
            </Text>, {nos:'5.5.1',pre:'※',},false,'安全距离'),
        crtOmni('口站台高',{third:'K5.5.2',},undefined,
            <Text>(1)乘人部分进出口到站台台面的垂直距离应符合设计文件及以下要求，乘人部分进出口距站台的高度，应当便于乘客上下。
            </Text>, {nos:'5.5.2',},false,'进出口距站台高度'),
        //【PDF毛病】拷贝出来的 显示是 第一行的，copy:却被放到了第二行。
        crtOmni('转台面隙',{third:'K5.5.3',},undefined,
            <Text>(1)转动平台台面应有防滑措施，设有转动平台时，转动平台与固定部分之间的间隙应符合设计文件 及以下要求，间隙应当合理，防止乘客脚部受到伤害；若平台高于站台面，其垂直方向的间隙应当
                 适当，不应当对乘客的脚部造成危险;且应符合设计文件要求。
            </Text>, {nos:'5.5.3',},false,'转动平台台面及其间隙'),
    ],'5.5.1安全距离-5.5.3转动平台台面间隙');
    pushOmni(ari,'6.1',[
        crtOmni('安保要求',{big:'K6安全保护装置和防护措施检验',bspan:7,span:1,seco:'K6.1',},undefined,
            <Text>(1)安全联锁装置、起动确认按钮、监控措施的设置等安全保护装置和防护措施应符合设计文件要求。
            </Text>, {nos:'6.1',},false,'一般要求'),
        crtOmni('制动资料',{span:5,seco:'※K6.2制动装置与制动距离',},{seco:'※K6.2',},
            <Text>(1)相关资料和自检报告应符合要求
            </Text>, {nos:'6.2(1)',pre:'※',mergLabel:'制动装置与制动距离' },true, '（1）制动装置资料',),
        crtOmni('制动结构',{},undefined,
            <Text>(2)制动装置的连接螺栓不应松动、结构件不应变形、固定位置不应偏移。
            </Text>, {nos:'6.2(2)',pre:'※', },true, '（2）制动装置连接、结构件、固定位置情况',),
        crtOmni('制动动作',{},undefined,
            <Text>(3)按照实际运行工况、断电工况进行试验，各种工况试验时制动装置应能够有效动作。
            </Text>, {nos:'6.2(3)',pre:'※', },true, '（3）制动装置动作',),
        crtOmni('制动距离',{},undefined,
            <Text>(4)在满载工况下最大速度运行时的制动距离，应符合设计文件要求。
                <JumpMeasure tag={'Measure2'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'6.2(4)',pre:'※', },true, '（4）制动距离',),
        crtOmni('制动磨损',{},undefined,
            <Text>(5)安装位置和安装方式应符合设计文件要求；对有磨损的机械式制动装置在磨损严重部位测量闸衬厚度，磨损量应当不大于原厚度50%且满足设计文件要求。
            </Text>, {nos:'6.2(5)',pre:'※', mergNos:'6.2',mergName:'制动装置',},false, '（5）安装位置和安装方式、磨损情况',),
        crtOmni('止逆行装',{seco:'※K6.3',},undefined,
            <Text>(1)列车或者车辆满载情况下，防止车辆逆行装置应有效。 安全走道应牢固。
            </Text>, {nos:'6.3',pre:'※',},false,'止逆行装置及疏导乘客措施'),
    ],'6.1安全保护一般要求-6.3止逆行装置及疏导乘客');
    //"sk":[{"pr":"※","no":"6.4","r":0,"bs":[8],"ss":[1]},{"pr":"※","r":0},{"pr":"※","no":"6.7","r":0},{"pr":"※","r":0},{"no":"6.9.1","ss":[2],"ts":[1],"r":0},0,{"no":"6.12","ss":[1],"r":0},0
    pushOmni(ari,'6.4',[
        crtOmni('防超速',{bspan:10,span:1,seco:'※K6.4',},undefined,
            <Text>(1)有可能超速的大型游乐设施应当设有安全可靠的限速装置或者采取限速措施；防超速装置应有效。
            </Text>, {nos:'6.4',pre:'※',},false,'防超速控制装置'),
        crtOmni('限位装置',{seco:'※K6.5',},undefined,
            <Text>(1)大型游乐设施在运行中超过预定位置有可能发生危险时，应当设置限位装置，阻止其向不安全方向运行；必要时加装能切断总电源的极限位置开关。
            </Text>, {nos:'6.5',pre:'※',},false,'限位装置'),
        crtOmni('防碰装置',{seco:'※K6.6',},undefined,
            <Text>(1)同一轨道、滑道、专用车道等有两组以上(含两组）车辆运行的大型游乐设施，无人操作的应当设防止相互碰撞的自动控制装置。
            </Text>, {nos:'6.6',pre:'※',},false,'防碰撞装置'),
        crtOmni('缓冲装置',{seco:'※K6.7',},undefined,
            <Text>(1)缓冲装置应当符合设计文件及以下要求，升降装置的极限位置，必要时应当设置缓冲装置，防止升降过程出现异常冲击和振动。
            </Text>, {nos:'6.7',pre:'※',},false,'缓冲装置'),
        crtOmni('门锁紧',{seco:'※K6.8',},undefined,
            <Text>(1)锁紧装置应符合设计文件要求，其锁紧情况及安装应牢固；距离地面有一定高度且人员有跌落伤
                害风险的封闭座舱，座舱门应当设置乘客在内部不能开启的两道锁紧装置或者一道带保险的锁紧装置，非封闭座舱进出口处的拦挡物，也应当有带保险的锁紧装置。
            </Text>, {nos:'6.8',pre:'※',},false,'乘人舱门锁紧装置'),
        crtOmni('吊挂保险',{seco:'K6.9保险措施',span:2,third:'K6.9.1',tspan:1,},undefined,
            <Text>(1)吊挂乘人部分应有保险措施。
            </Text>, {nos:'6.9.1',},false,'吊挂乘人部分保险措施'),
        crtOmni('吊舱保险',{third:'K6.9.2',},undefined,
            <Text>(1)吊舱吊挂应有保险措施。
            </Text>, {nos:'6.9.2',},false,'吊舱吊挂保险措施'),
        crtOmni('立柱导向',{span:1,seco:'K6.11',},undefined,
            <Text>(1)导向装置起动和停止时有无明显冲击、异常抖动等现象。
            </Text>, {nos:'6.11',},false,'立柱导向装置'),
        crtOmni('风速计',{seco:'K6.12',},undefined,
            <Text>(1)设备高度或者运行高度20m以上的室外大型游乐设施，应当设有风速计；风速计应当有方便操作人员观察的数据显示装置和报警功能。风速计应正常，其安装应符合设计文件要求。
            </Text>, {nos:'6.12',},false,'风速计'),
        crtOmni('防护罩',{seco:'K6.13',},undefined,
            <Text>(1)防护罩等机械安全防护应符合设计文件及以下要求，人员可触及的机械传动部件（如齿轮、皮带轮、联轴器等），应当有防护罩或者其他防护措施。
            </Text>, {nos:'6.13',},false,'防护罩等机械安全防护'),
    ],'6.4防超速控制装置-6.13防护罩等安全防护');
    pushOmni(ari,'6.14',[
        crtOmni('安全网',{bspan:12,span:1,seco:'K6.14',},undefined,
            <Text>(1)在易发生乘客、物体坠落从而导致（或造成）人员伤害的位置（或区域），应当设置安全网或者有相应的安全措施。安全网或者防坠设施（措施）应完好。
            </Text>, {nos:'6.14',},false,'安全网或者其他措施'),
        crtOmni('警示标',{seco:'K6.15',},undefined,
            <Text>(1)安全警示标志装设情况应规范、醒目、完好。
            </Text>, {nos:'6.15',},false,'安全警示标志'),
        crtOmni('防倾翻装',{seco:'※K6.16',},undefined,
            <Text>(1)沿架空轨道运行的车辆，应当设置防倾翻装置。
            </Text>, {nos:'6.16',pre:'※',},false,'防倾翻装置'),
        crtOmni('断绳保',{seco:'※K6.17',},undefined,
            <Text>(1)断绳保护装置应有效。
            </Text>, {nos:'6.17',pre:'※',},false,'断绳保护装置'),
        crtOmni('操作室',{seco:'K6.18',},undefined,
            <Text>(1)操作室应单独设置，操作空间和照明应当满足操作需要，方便操作；在操作人员无法观察道运行情况并有可能发生危险的盲区，应当设置监视系统等安全措施；操作室视野应当开阔，操作室内不
                能观察到全部乘客上下情况且乘客束缚装置没有与起动按钮联锁的，应当在相应的位置设置起动确认联锁按钮。
            </Text>, {nos:'6.18',},false,'操作室'),
        crtOmni('站台设置',{seco:'K6.19',},undefined,
            <Text>(1)站台不应对设备运行产生干涉，运行时活动站台应处于锁死状态；站台高度应设置合理，应设置防滑措施。
            </Text>, {nos:'6.19',},false,'站台设置'),
        crtOmni('安全栅栏',{seco:'K6.20',},undefined,
            <Text>(1)栅栏的设置和栅栏高、间隙应符合设计文件的要求，且应符合如下要求：1）大型游乐设施周围及站台，应当设置安全栅栏或者其他有效的隔离设施，防止人员误入、跌落以及设备与站外人员发
                生肢体碰撞等；安全栅栏高度应当不低于1100mm；栅栏的间隙和距离地面的间隙应当不大于 120mm；安全栅栏应当设置为儿童不易攀爬的结构；
                2）安全栅栏应当分别设进出口，在进口处宜有引导栅栏；站台应当有防滑措施； 3）安全栅栏门开启方向应当与乘客行进方向一致(特殊情况除外) ；
                4）安全栅栏等门边框与立柱之间的间隙应当适当，或者采取其他防止夹手的措施。
                <JumpMeasure tag={'Measure2'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'6.20',},false,'安全栅栏设置'),
        crtOmni('装饰物',{seco:'K6.21',},undefined,
            <Text>(1)不应有未经设计校核的装饰物，经过设计校核的装饰物应固定完好。
            </Text>, {nos:'6.21',},false,'装饰物'),
        crtOmni('进出口',{seco:'K6.22',},undefined,
            <Text>(1)进出口台阶的宽度和高度、进出口的斜坡坡度应当方便人员出入；台阶踏面纵向宽度应当不小于240mm，高度为140mm～200mm；进出口为斜坡时，坡度应当不大于1:6，有防滑措施的斜坡，
                坡度应当不大于1:4；阶梯高度和坡度应当保持一致。
                <JumpMeasure tag={'Measure2'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'6.22',},false,'进出口'),
        crtOmni('疏导救援',{seco:'K6.23',},undefined,
            <Text>(1)审查相关资料和应急演练报告；进行应急救援模拟试验，疏散时间应满足法规要求。
            </Text>, {nos:'6.23',},false,'疏导乘客措施与应急救援'),
        crtOmni('防高点止',{seco:'K6.24',},undefined,
            <Text>(1)对存在最高点出现静止状态的设备，应设置有防止或者处理该状态的措施。
            </Text>, {nos:'6.24',},false,'防止最高点出现静止状态措施'),
        crtOmni('备用电源',{seco:'K6.25',},undefined,
            <Text>(1)备用电源和救援设备数量、结构型式、连接方式应符合设计文件要求。外观不应破损缺失，结构不应有变形、损坏，功能应正常。
            </Text>, {nos:'6.25',},false,'备用电源和救援设备'),
    ],'6.14安全网或其他-6.25备用电源和救援设备');
    //"sk":[{"no":"7.1","r":2,"bs":[7],"ss":[2],"vx":1},0,0,{"no":"7.5","r":0},0,0
    pushOmni(ari,'7.1',[
        crtOmni('空载运',{big:'K7载荷试验与测试',bspan:7,span:2,seco:'K7.1空载运行试验',},{seco:'K7.1',},
            <Text>(1)审查受检单位提供的不少于2h的空载运行报告，该报告应符合如下要求：(1)设备的起动、换向、停机、制动和安全联锁等动作，均应当正确、灵敏、可靠；(2)整机应当运行正常，不允许有爬
                行和异常的振动、冲击、发热及声响；(3)各传动部件应当平稳，无异常振动、窜动、冲击、噪声、磨损和永久变形；(4)轴承温升及油箱油温应当符合设计要求；(5)齿轮及齿条传动不应当有偏啮合及
                偏磨损；(6)电气系统、控制系统应当工作正常；(7)润滑、液压(气动) 等辅助系统的工作应当正常，无渗漏现象；(8)零部件及其连接应当牢固可靠，不允许有永久变形和损坏现象；(9)起动和停止时立
                柱的导向装置应当无明显冲击和异常抖动现象；(10)靠摩擦力提升的设备，摩擦面之间不允许有明显的相对滑动；(11)正常工况下动态参数测试结果应当符合设计要求。
            </Text>, {nos:'7.1(1)', mergLabel:'空载运行试验'},true, '（1）空载运行报告',),
        crtOmni('空载试',{},undefined,
            <Text>(2)设备起、制动应平稳可靠，运行过程中不应爬行和异常的振动、冲击、发热和声响等现象。
            </Text>, {nos:'7.1(2)', mergNos:'7.1',mergName:'空载运行',},false, '（2）空载运行试验',),
        crtOmni('满载试验',{seco:'K7.2',},undefined,
            <Text>(1)审查受检单位提供的不少于16h的满载运行报告或者对型式试验证书覆盖范围内，与型式试验样机不一致的首台（套）大型游乐设施，受检单位提供不少于80h的满载运行报告，该报告应符合如下要求：(1)设备的起动、换
                向、停机、制动和安全联锁等动作，均应当正确、灵敏、可靠；(2)整机应当运行正常，不允许有爬行和异常的振动、冲击、发热及声响；(3)各传动部件应当平稳，无异常振动、窜动、冲击、噪声、磨损和永久变形；(4)轴
                承温升及油箱油温应当符合设计要求；(5)齿轮及齿条传动不应当有偏啮合及偏磨损；(6)电气系统、控制系统应当工作正常 ；(7)润滑、液压(气动) 等辅助系统的工作应当正常，无渗漏现象；(8)零部件及其连接应当牢固可
                靠，不允许有永久变形和损坏现象；(9)起动和停止时立柱的导向装置应当无明显冲击和异常抖动现象；(10)靠摩擦力提升的设备，摩擦面之间不允许有明显的相对滑动；(11)在额定载荷下，载人装置停在提升段任意位置，提
                升机构均应当能平稳起动；(12)正常工况下动态参数测试结果应当符合设计要求。 设备起、制动应平稳可靠，运行过程中不应爬行和异常的振动、冲击、发热和声响等现象。
            </Text>, {nos:'7.2',},false,'满载运行试验'),
        crtOmni('偏载试验',{seco:'K7.3',},undefined,
            <Text>(1)受检单位提供的偏载试验报告应符合如下要求：(1)设备的起动、换向、停机、制动和安全联锁等动作，均应当正确、灵敏、可靠；(2)整机应当运行正常，不允许有爬行和异常的振动、冲击、发热
                及声响；(3)各传动部件应当平稳，无异常振动、窜动、冲击、噪声、磨损和永久变形；(4)轴承温升及油箱油温应当符合设计要求；(5)齿轮及齿条传动不应当有偏啮合及偏磨损；(6)电气系统、控制系
                统应当工作正常；(7)润滑、液压(气动) 等辅助系统的工作应当正常，无渗漏现象；(8)零部件及其连接应当牢固可靠，不允许有永久变形和损坏现象；(9)起动和停止时立柱的导向装置应当无明显冲击
                和异常抖动现象；(10)靠摩擦力提升的设备，摩擦面之间不允许有明显的相对滑动；(11)正常工况下动态参数测试结果应当符合设计要求。
                设备起、制动应平稳可靠，运行过程中不应爬行和异常的振动、冲击、发热和声响等现象。
            </Text>, {nos:'7.3',},false,'偏载运行试验'),
        crtOmni('参数测试',{seco:'K7.5',},undefined,
            <Text>(1)主要技术参数测试值应符合设计文件要求，动态性能参数与设计计算值的偏差为-10％～5％。
                <JumpMeasure tag={'MainTechnical'} rep={rep}>附录A主要技术参数测试</JumpMeasure>
            </Text>, {nos:'7.5',},false,'主要技术参数测试'),
        crtOmni('应力测试',{seco:'K7.6',},undefined,
            <Text>(1)设计文件鉴定报告中有应力测试要求的或者运行中冲击较大或者存在安全隐患的设备，审查受检单位提供的应力测试报告，必要时对主要受力部件的应力进行抽查测试，测试结果应当满足设计文
                件要求。
                <JumpMeasure tag={'StrainStress'} rep={rep}>附录B 应力测试记录</JumpMeasure>
            </Text>, {nos:'7.6',},false,'应力测试'),
        crtOmni('加速度测',{seco:'K7.7',},undefined,
            <Text>(1)设计文件鉴定报告中有加速度测试要求的或者存在加速度安全隐患的设备，审查受检单位提供的加速度测试报告，必要时进行抽查测试，测试结果应当满足设计文件要求。
                <JumpMeasure tag={'Acceleration'} rep={rep}>附录C 加速度检测记录</JumpMeasure>
            </Text>, {nos:'7.7',},false,'加速度测试'),
    ],'7.1空载运行报告-7.7加速度测试');
    //"sk":[{"no":"13.1","r":0,"bs":[10],"ss":[1]},0,0,0,{"r":6,"ss":[6],"vx":1}
    pushOmni(ari,'13.1',[
        crtOmni('人数高度',{big:'K13系留式观光气球专项检验',bspan:10,span:1,seco:'K13.1',},undefined,
            <Text>(1)承载人数应当不大于4人，升空高度应当不大于50m。
                <JumpMeasure tag={'Measure2'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'13.1',},false,'承载人数和升空高度'),
        crtOmni('升回速度',{seco:'K13.2',},undefined,
            <Text>(1)升空速度应当不大于2m/s，回收速度应当不大于1m/s。
            </Text>, {nos:'13.2',},false,'升空、回收速度'),
        crtOmni('安全区',{seco:'K13.3',},undefined,
            <Text>(1)使用现场地面应当有以系留缆绳为中心，半径不小于12m的安全区域，架设和运营场地顶空±45°区域内应当无障碍物。
            </Text>, {nos:'13.3',},false,'使用现场安全区域'),
        crtOmni('客非金件',{seco:'K13.4',},undefined,
            <Text>(1)与乘客安全有关的非金属件均应当有明确更换周期并定期更换。
            </Text>, {nos:'13.4',},false,'与乘客安全有关的非金属件'),
        crtOmni('副气囊',{span:6,seco:'K13.5气囊系统',},{seco:'K13.5',},
            <Text>(1)气囊系统应当包含气囊和副气囊，使用温度范围应当覆盖-35℃～60℃。
            </Text>, {nos:'13.5(1)', mergLabel:'气囊系统', rtspan:6 },true, '（1）气囊和副气囊',),
        crtOmni('充装气体',{},undefined,
            <Text>(2)气囊内应当充装氦气，禁止使用氢气，副气囊容积应当不小于在充装氦气后，气囊内温度升高15℃氦气所增加的体积与气囊内温度降低15℃氦气所减少的体积之差。
            </Text>, {nos:'13.5(2)', },true, '（2）充装气体、副气囊容积',),
        crtOmni('气囊材料',{},undefined,
            <Text>(3)气囊材料应当选用轻质高强的织物层压复合材料，至少应当包括气密层、承力层和耐候层，气体透过率应当不大于1.5×10-2cm3/（m2·d·Pa）。
            </Text>, {nos:'13.5(3)', },true, '（3）气囊材料',),
        crtOmni('囊连接',{},undefined,
            <Text>(4)气囊的连接部位应当采用熔接热合或者高频热合工艺。
            </Text>, {nos:'13.5(4)', },true, '（4）气囊的连接',),
        crtOmni('防磨',{},undefined,
            <Text>(5)气囊与其他硬质部件存在相对滑移的接触部位应当采取防磨措施。
            </Text>, {nos:'13.5(5)', },true, '（5）防磨措施',),
        crtOmni('补强密封',{},undefined,
            <Text>(6)气囊与其他部件连接部位应当有补强和密封措施。
            </Text>, {nos:'13.5(6)', mergNos:'13.5',mergName:'密封措施',},false, '（6）补强和密封措施',),
    ],'13.1承载人数和升空高度-13.5气囊系统');
    //"sk":[{"no":"13.6","r":3,"bs":[9],"ss":[3],"vx":1},{"r":6,"ss":[6],"vx":1}
    pushOmni(ari,'13.6',[
        crtOmni('网囊连接',{bspan:9,span:3,seco:'K13.6悬吊系统',},{seco:'K13.6',},
            <Text>(1)网罩和气囊连接应当牢固，能够防止气囊在网罩内翻转。
            </Text>, {nos:'13.6(1)', mergLabel:'悬吊系统', rtspan:3},true, '（1）网罩和气囊的连接',),
        crtOmni('气囊包覆',{},undefined,
            <Text>(2)网罩对气囊的包覆面积应当不小于气囊表面积的2/3。
            </Text>, {nos:'13.6(2)', },true, '（2）网罩对气囊的包覆面积',),
        crtOmni('网乘连接',{},undefined,
            <Text>(3)网罩和乘人装置之间的连接结构应当采用金属材料。
            </Text>, {nos:'13.6(3)', mergNos:'13.6',mergName:'悬吊系统',},false, '（3）网罩和乘人装置的连接',),
        crtOmni('舱警示标',{span:6,seco:'K13.7乘人装置',},{seco:'K13.7',},
            <Text>(1)吊舱应当在显著位置设置安全警示标识，明确承载人数和乘坐时的注意事项。
            </Text>, {nos:'13.7(1)', mergLabel:'乘人装置', rtspan:6},true, '（1）吊舱安全警示标识',),
        crtOmni('封闭吊舱',{},undefined,
            <Text>(2)封闭式吊舱应当设有通气孔，门窗应当安装拦挡物，乘客头部应当不能伸出舱外。
            </Text>, {nos:'13.7(2)', },true, '（2）封闭式吊舱',),
        crtOmni('非封闭舱',{},undefined,
            <Text>(3)非封闭式吊舱侧面拦挡物高度应当不低于1.2m；侧面和顶部应当设置防护网。
                <JumpMeasure tag={'Measure2'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'13.7(3)', },true, '（3）非封闭式吊舱',),
        crtOmni('舱门锁',{},undefined,
            <Text>(4)吊舱门应当设置两道锁紧装置。
            </Text>, {nos:'13.7(4)', },true, '（4）吊舱门锁紧装置',),
        crtOmni('吊椅',{},undefined,
            <Text>(5)编织物型式吊椅应当有产品合格证、定型试验报告或者产品认证，其破断拉力应当不小于每名乘客12000N。
            </Text>, {nos:'13.7(5)', },true, '（5）编织物型式吊椅',),
        crtOmni('锁扣',{},undefined,
            <Text>(6)运行过程中，乘客应当不能自行打开编织物型式吊椅上的任何安全锁扣。
            </Text>, {nos:'13.7(6)', mergNos:'13.7',mergName:'乘人装置',},false, '（6）安全锁扣',),
    ],'13.6悬吊系统-13.7乘人装置');
    pushOmni(ari,'13.8',[
        crtOmni('系留',{bspan:12,span:6,seco:'K13.8系留和锚泊系统',},{seco:'K13.8',},
            <Text>(1)系留缆绳应当符合GB/T 8918《重要用途钢丝绳》的有关规定。
            </Text>, {nos:'13.8(1)',mergLabel:'系留和锚泊系统', rtspan:6 },true, '（1）系留缆绳',),
        crtOmni('保险绳',{},undefined,
            <Text>(2)为防止系留缆绳断裂时气球逃逸，应当设置不少于3根保险绳。
            </Text>, {nos:'13.8(2)', },true, '（2）保险绳',),
        crtOmni('回收装',{},undefined,
            <Text>(3)升空回收装置应当设置限位传感器、极限位置传感器、超速检测装置和安全制动器。
            </Text>, {nos:'13.8(3)', },true, '（3）升空回收装置',),
        crtOmni('升空制动',{},undefined,
            <Text>(4)升空回收装置应当设置两套独立的制动装置，任何一套失效时，另一套能够保证安全；两套制动装置均应当采用可手动释放和常闭式结构。
            </Text>, {nos:'13.8(4)', },true, '（4）升空回收装置制动装置',),
        crtOmni('应急回收',{},undefined,
            <Text>(5)系留式观光气球应当设置应急回收装置，用于升空回收装置失效时回收气球。
            </Text>, {nos:'13.8(5)', },true, '（5）应急回收装置',),
        crtOmni('锚绳',{},undefined,
            <Text>(6)锚绳数量应当不少于3根。
                <JumpMeasure tag={'Measure2'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'13.8(6)', mergNos:'13.8',mergName:'系留锚泊',},false, '（6）锚绳',),
        crtOmni('电缆',{span:6,seco:'K13.9电气与控制系统',},{seco:'K13.9',},
            <Text>(1)吊舱内设有电气装置时，电缆应当采用阻燃电缆。
            </Text>, {nos:'13.9(1)',mergLabel:'电气与控制系统', rtspan:6 },true, '（1）电缆',),
        crtOmni('供电压',{},undefined,
            <Text>(2)空中设备的供电电压应当不大于50V。
            </Text>, {nos:'13.9(2)', },true, '（2）空中设备的供电电压',),
        crtOmni('监测显示',{},undefined,
            <Text>(3)控制系统应当监测气囊压力、气囊温度、副气囊压力、系留缆绳拉力和风速等重要状态参数并在操作面板实时显示。
            </Text>, {nos:'13.9(3)', },true, '（3）重要状态参数的监测与显示',),
        crtOmni('压力调节',{},undefined,
            <Text>(4)系留式观光气球应当设置压力调节系统，实时调节气囊压力。
            </Text>, {nos:'13.9(4)', },true, '（4）压力调节系统',),
        crtOmni('氦气释放',{},undefined,
            <Text>(5)系留式观光气球应当设置应急救援的氦气释放装置；自动装置失效时，可手动释放氦气。
            </Text>, {nos:'13.9(5)', },true, '（5）氦气释放装置',),
        crtOmni('风速球顶',{},undefined,
            <Text>(6)风速计应当设置在气球顶部。
            </Text>, {nos:'13.9(6)', mergNos:'13.9',mergName:'电气控制',},false, '（6）风速计',),
    ],'13.8系留和锚泊系统-13.9电气与控制系统');

    if (!noDefault) ari = omniCalculateDefault(ari, {iclasDefault: "K", displayDefault: true});
    return {Item: ari,} as { [key: string]: any[] };
};
