/** @jsxImportSource @emotion/react */
import * as React from "react";
import {CCell, Table, TableBody, TableRow, Text,} from "customize-easy-ui-component";
import {crtOmni, omniCalculateDefault, pushOmni} from "../../common/omni";
import {JumpMeasure, } from "../../common/general";

export const setupItemAreaRoute= ({rep, orc, theme, noDefault} :{rep:any,orc?:any, theme:any,noDefault?:boolean}
) => {
    let ari: any[] =[];
    //"sk":[ {"pr":"※","no":"1.1", "r":2, "bs":[11],"ss":[2],"vx":1}, {"no":"1.2", "r":3, "ss":[3],"vx":1}, {"no":"1.3", "r":0},0,0, {"pr":"※","no":"1.8", "r":2, "ss":[2],"vx":1},{"pr":"※","no":"1.9", "r":0}
    //生成后要，手动给自拆分项目加上mergLabel;改动+加{seco:'※K1.1特种设备生' }；
    pushOmni(ari,'1.1',[
        crtOmni('许可证',{big:'K1资料审查',bspan:11,span:2,seco:'※K1.1特种设备生产许可证',},{seco:'※K1.1' },
            <Text>(1)制造、安装、改造或者修理单位的相关许可证件，应符合许可证的范围，有效期应符合要求。
            </Text>, {nos:'1.1(1)',pre:'※', mergLabel:'特种设备生产许可证'},true, '（1）特种设备生产许可证',),
        crtOmni('施工告知',{},undefined,
            <Text>(2)应按照要求办理施工告知手续。
            </Text>, {nos:'1.1(2)',pre:'※', mergNos:'1.1',mergName:'生产许可',},false, '（2）施工告知',),
        crtOmni('出厂文件',{span:3,seco:'K1.2产品资料',},{seco:'K1.2' },
            <Text>(1)出厂文件和资料、主要受力部件材料证明、标准机电产品合格证明、产品质量证明、设备自检报告、设备运行试验记录应齐全。
            </Text>, {nos:'1.2(1)', mergLabel:'产品资料'},true, '（1）出厂文件和资料',),
        crtOmni('型式试验',{},undefined,
            <Text>(2)※设计文件鉴定、型式试验报告及证书，应覆盖监督检验的大型游乐设施。
            </Text>, {nos:'1.2(2)', },true, '（2）设计文件鉴定、型式试验报告及证书',),
        crtOmni('设计变更',{},undefined,
            <Text>(3)设计一致性或者设计变更说明，以及设计变更资料应符合规定。
            </Text>, {nos:'1.2(3)', mergNos:'1.2',mergName:'产品资料',},false, '（3）设计一致性或者变更说明',),
        crtOmni('施工文件',{seco:'K1.3',},undefined,
            <Text>(1)施工作业（工艺）文件应经施工单位技术负责人批准，内容包括作业程序、技术要求、方法和措施。
            </Text>, {nos:'1.3',},false,'施工文件'),
        crtOmni('基础验收',{seco:'K1.4',},undefined,
            <Text>(1)应有经过施工单位盖章确认的基础验收合格证明。
            </Text>, {nos:'1.4',},false,'基础验收资料'),
        crtOmni('自检报告',{seco:'K1.5',},undefined,
            <Text>(1)施工单位各项施工应有自检报告，并且有自检人员签字确认。
            </Text>, {nos:'1.5',},false,'自检报告'),
        crtOmni('无损报',{span:2,seco:'※K1.8无损检测报告',},{seco:'※K1.8',},
            <Text>(1)审查主要受力部件和重要焊缝无损检测报告，图纸和工艺文件规定的零部件、部位应按照规定方法与比例进行检测。
            </Text>, {nos:'1.8(1)',pre:'※', mergLabel:'无损检测报告'},true, '（1）无损检测报告',),
        crtOmni('无损检资',{},undefined,
            <Text>(2)无损检测人员及第三方无损检测单位（如涉及）应具有特种设备无损检测资格。
            </Text>, {nos:'1.8(2)',pre:'※', mergNos:'1.8',mergName:'无损检',},false, '（2）无损检测资格',),
        crtOmni('安保资料',{seco:'※K1.9',},undefined,
            <Text>(1)审查相关资料、特种设备及安全附件的使用手续、定期检验报告、校验报告，其应符合相应设备的要求。
            </Text>, {nos:'1.9',pre:'※',},false,'其他特种设备、安全附件及安全保护装置资料'),
    ],'1.1生产许可证-1.9安全附件及安全保护装置资料');
    //"sk":[ {"no":"2.1", "r":2, "bs":[11],"ss":[2],"vx":1}, 0,0,0,0, 0,0,0,0, {"pr":"※","no":"2.10", "r":0}
    pushOmni(ari,'2.1',[
        crtOmni('铭牌',{big:'K2机械与结构检验',bspan:11,span:2,seco:'K2.1产品铭牌与乘客须知',}, {seco:'K2.1',},
            <Text>(1)设备显著位置应固定产品铭牌，产品铭牌内容至少包括制造单位名称与制造地址、特种设备生产许可证号、设备类别和型式、产品编号、制造日期、主要技术参数。
            </Text>, {nos:'2.1(1)', mergLabel:'产品铭牌与乘客须知'},true, '（1）产品铭牌',),
        crtOmni('须知',{},undefined,
            <Text>(2)乘客须知内容、配置位置应符合使用维护保养说明书的要求和实际情况。
            </Text>, {nos:'2.1(2)', mergNos:'2.1',mergName:'乘客须知',},false, '（2）乘客须知',),
        crtOmni('基础',{seco:'K2.2',},undefined,
            <Text>(1)基础与设备的连接方式应符合设计文件要求，基础无影响设备正常运行的不均匀沉降、开裂，移动式设备基础应符合使用维护保养说明书规定。
            </Text>, {nos:'2.2',},false,'基础'),
        crtOmni('地脚螺栓',{seco:'K2.3',},undefined,
            <Text>(1)地脚螺栓连接应有防松措施和防松标识；防松措施类型应符合设计文件要求；地脚螺栓应无松动、严重腐蚀。
            </Text>, {nos:'2.3',},false,'地脚螺栓'),
        crtOmni('主受力件',{seco:'K2.4',},undefined,
            <Text>(1)结构型式、所用材料、焊缝布置、连接等应符合设计文件要求；表面质量不应存在严重腐蚀、磨损、弯曲、变形等缺陷，结构件的最大锈蚀深度应当小于原型钢厚度的15%。
                <JumpMeasure tag={'Measure'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'2.4',},false,'主要受力部件'),
        crtOmni('重要轴',{seco:'K2.5',},undefined,
            <Text>(1)重要轴（销轴）材料、热处理、硬度、加工圆角、几何尺寸偏差等应符合设计文件要求。
            </Text>, {nos:'2.5',},false,'重要轴（销轴）材料、表面硬度及加工尺寸'),
        crtOmni('轴磨损',{seco:'K2.6',},undefined,
            <Text>(1)磨损量和锈蚀量应符合维护保养说明书及以下要求，重要轴（销轴）最大磨损量应当小于原直径的0.8%，且最大值不超过1mm；重要轴（销轴）的锈蚀量(经打磨后)，应当小于原直径的1%(包括
                凹坑处），且最大不超过1mm。
                <JumpMeasure tag={'Measure'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'2.6',},false,'重要轴（销轴）磨损和锈蚀'),
        crtOmni('隐蔽件',{seco:'K2.7',},undefined,
            <Text>(1)隐蔽件的结构型式应符合设计文件要求。
            </Text>, {nos:'2.7',},false,'隐蔽件'),
        crtOmni('螺栓连接',{seco:'K2.8',},undefined,
            <Text>(1)重要螺栓、重要轴(销轴)连接选型应符合设计文件要求，重要螺栓应无松动现象，重要轴（销轴）不应存在脱落风险。
            </Text>, {nos:'2.8',},false,'重要螺栓、重要轴（销轴）连接'),
        crtOmni('焊缝表面',{seco:'K2.9',},undefined,
            <Text>(1)焊缝表面及热影响区表面不应当存在漏焊、烧穿、裂纹、未焊透、密集气孔、塌陷、严重咬边、未焊满、夹渣等外观缺陷。
            </Text>, {nos:'2.9',},false,'焊缝表面质量'),
        crtOmni('焊缝无损',{seco:'※K2.10',},undefined,
            <Text>(1)受检单位无损检测应按照设计文件要求或者使用维护保养说明书规定进行并检测合格，可通过资料审查或者对重要轴(销轴)、重要焊缝进行表面无损检测抽查进行。对A级大型游乐设施重要轴（销
                轴）、重要焊缝进行不少于20%的表面无损检测抽查；对于延长使用期限的，进行不少于30%的表面无损检测抽查。
            </Text>, {nos:'2.10',pre:'※',},false,'重要焊缝和重要轴（销轴）无损检测'),
    ],'2.1铭牌-2.10重要焊缝和重要轴无损检测');
    //"sk":[ {"no":"3.1","r":0,"bs":[9],"ss":[1]}, 0,0,0, {"no":"3.5.1","r":0,"ss":[5],"ts":[1]},0,0, {"pr":"※","no":"3.5.4","r":0},0 #项目区栏目数有变动的那一行必须注明即使只有单一行span的<td>
    //生成后续人工改：有项目区栏目数变动的，加seco:'K3.5乘人部分钢丝绳'；
    pushOmni(ari,'3.1',[
        crtOmni('液压系统',{big:'K3传动系统检验',bspan:9,span:1,seco:'K3.1',},undefined,
            <Text>(1)液压（气动）系统应符合设计文件要求；液压（气动）系统运转正常。
            </Text>, {nos:'3.1',},false,'液压（气动）系统装置'),
        crtOmni('齿轮传动',{seco:'K3.2',},undefined,
            <Text>(1)齿轮应无偏啮合及偏磨损情况。
            </Text>, {nos:'3.2',},false,'齿轮传动'),
        crtOmni('皮带传动',{seco:'K3.3',},undefined,
            <Text>(1)采用皮带或者链传动时，应当设置可调整皮带或者链条的张紧机构。皮带和链传动应当拉紧适度；皮带应当无破损、老化、断裂，皮带连接部无伤痕、剥离；皮带传动工作时不应当有明显的打
                滑和跑偏等异常现象；链传动不应当出现脱链、跳齿及影响使用的松边颤振等现象。
            </Text>, {nos:'3.3',},false,'皮带和滚子链传动'),
        crtOmni('转向机构',{seco:'K3.4',},undefined,
            <Text>(1)转向机构应灵活、可靠，无卡滞现象。
            </Text>, {nos:'3.4',},false,'转向机构'),
        crtOmni('端部固定',{seco:'K3.5乘人部分钢丝绳',span:5,third:'K3.5.1',tspan:1,},undefined,
            <Text>(1)钢丝绳端部固定所采取的方式应有效。
            </Text>, {nos:'3.5.1',},false,'钢丝绳端部固定'),
        crtOmni('轮绳径比',{third:'K3.5.2',},undefined,
            <Text>(1)提升乘人装置用的卷筒、滑轮直径与钢丝绳直径之比应当不小于30；钢丝绳对滑轮包角不大于90°时，滑轮直径与钢丝绳直径之比应当不小于20。
                <JumpMeasure tag={'Measure'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'3.5.2',},false,'卷筒、滑轮直径与钢丝绳直径之比'),
        crtOmni('绳防过卷',{third:'K3.5.3',},undefined,
            <Text>(1)提升钢丝绳应装有限位或者其他防止钢丝绳过卷、松弛装置，卷筒上应留有一定的余量。
            </Text>, {nos:'3.5.3',},false,'钢丝绳防过卷、松弛装置'),
        crtOmni('防脱落',{third:'※K3.5.4',},undefined,
            <Text>(1)应设置防止钢丝绳从滑轮上脱落和跳槽的结构，防脱落装置应可靠。
            </Text>, {nos:'3.5.4',pre:'※',},false,'防止脱落装置'),
        crtOmni('绳断丝',{third:'K3.5.5',},undefined,
            <Text>传动和提升用钢丝绳断丝、磨损等缺陷应当符合相关国家或者行业标准要求。传动和提升用钢丝绳出现下列情况之一的,应报废:
                a)传动和提升用钢丝绳的断丝和磨损超过允许值时(见下表)； b)整根绳股断裂；
                c)钢丝绳的纤维芯或钢丝(或多层绳股的内部绳股)断裂,造成绳股显著减小时； d)由于外部腐蚀钢丝绳表面出现深坑，钢丝绳相当松弛时；
                e)经确认有严重的内部腐蚀时； f)出现笼形畸变时；
                g)绳股被挤出，这种状况通常伴随笼形畸变产生； h)局部直径严重增大或减小时；
                i)局部弯折、扭结或被压扁时； j)受特殊热力的作用，外表出现可识别的颜色时；
                k)超过设计及有关技术规程规定的使用寿命时。
                <Table fixed={ ["%","43%"] } css={{borderCollapse: 'collapse'}} tight miniw={800}><TableBody rheight={16}>
                    <TableRow><CCell>磨损状态</CCell><CCell>允许值</CCell></TableRow>
                    <TableRow><CCell>钢丝破断呈均匀分布状态</CCell><CCell>每股在一个捻距内破断数为3根</CCell></TableRow>
                    <TableRow><CCell>钢丝破断虽呈均匀分布状态，钢丝磨损后的剩余断面积为原断面积的80%以下或严重腐蚀</CCell><CCell>每股在一个捻距内破断数为2根</CCell></TableRow>
                    <TableRow><CCell>钢丝在一处破断或特别集中在一股时</CCell><CCell>钢丝破断总数在一个捻距内，6股为10根，8股为12根</CCell></TableRow>
                    <TableRow><CCell>磨损后的钢丝绳直径</CCell><CCell>为原钢丝绳直径的90%以上</CCell></TableRow>
                </TableBody></Table>
                <JumpMeasure tag={'Measure'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'3.5.5',},false,'钢丝绳断丝、磨损缺陷'),
    ],'3.1液压（气动）系统-3.5.5钢丝绳断丝磨损');
    //"sk":[ {"no":"3.6.1","r":0,"bs":[5],"ss":[4],"ts":[1]}, 0,0,0, {"no":"3.7","r":0,"ss":[1]}
    pushOmni(ari,'3.6.1',[
        crtOmni('提升系统',{bspan:5,seco:'K3.6乘人部分提升系统',span:4,third:'K3.6.1',tspan:1,},undefined,
            <Text>(1)提升系统运行时不应有异常声响和冲击振动。
            </Text>, {nos:'3.6.1',},false,'提升系统基本要求'),
        crtOmni('提升链条',{third:'K3.6.2',},undefined,
            <Text>(1)提升链条拉紧应适度。
            </Text>, {nos:'3.6.2',},false,'提升链条'),
        crtOmni('提升皮带',{third:'K3.6.3',},undefined,
            <Text>(1)提升皮带应装设有张紧装置、皮带松紧应适度，不会产生明显的损伤和跑偏。
            </Text>, {nos:'3.6.3',},false,'提升皮带'),
        crtOmni('导向装置',{third:'K3.6.4',},undefined,
            <Text>(1)导向装置应灵活可靠。
            </Text>, {nos:'3.6.4',},false,'导向装置'),
        crtOmni('油缸保险',{span:1,seco:'K3.7',},undefined,
            <Text>(1)乘人部分油（气）缸应有保险装置。
            </Text>, {nos:'3.7',},false,'乘人部分油（气）缸保险装置'),
    ],'3.6.1提升系统-3.7乘人部分油（气）缸保险');
    //"sk":[ {"no":"4.1","r":0,"bs":[7],"ss":[1]}, 0,0,{"pr":"※","r":0},{"no":"4.6","r":0},0,{"pr":"※","r":0}
    pushOmni(ari,'4.1',[
        crtOmni('电气安装',{big:'K4电气及控制系统检验',bspan:7,span:1,seco:'K4.1',},undefined,
            <Text>(1)电气设备应当安装牢固、完好。
            </Text>, {nos:'4.1',},false,'电气设备安装'),
        crtOmni('配电接地',{seco:'K4.2',},undefined,
            <Text>(1)低压配电系统的接地型式应当采用TN-S系统或者TN-C-S系统（使用独立变压器，供电距离短，对接地系统有特殊要求的设备，经安全分析能够满足安全使用要求的除外），且应符合设计文件要求。
            </Text>, {nos:'4.2',},false,'低压配电系统接地型式'),
        crtOmni('接地要求',{seco:'K4.3',},undefined,
            <Text>(1)电气设备中正常不带电的金属外壳、金属管槽、电缆金属保护层、互感器二次回路、变压器铁芯等应当可靠接地；低压配电系统保护接地电阻应当不大于10Ω。
            </Text>, {nos:'4.3',},false,'接地要求和接地电阻'),
        crtOmni('绝缘电阻',{seco:'※K4.4',},undefined,
            <Text>(1)电压有效值大于50V的带电回路与接地装置之间的绝缘电阻应当能保证用电安全，绝缘电阻应当不小于1MΩ。
                <JumpMeasure tag={'Measure'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'4.4',pre:'※',},false,'绝缘电阻'),
        crtOmni('电机电流',{seco:'K4.6',},undefined,
            <Text>(1)满载或者偏载运转平稳后，电动机电流值应符合设计文件及以下要求，在满载和设计允许偏载的情况下，连续工作的异步电机工作电流应当不大于电机的额定电流。
            </Text>, {nos:'4.6',},false,'电动机电流'),
        crtOmni('控制系统',{seco:'K4.7',},undefined,
            <Text>(1)控制系统应符合设计文件要求。
            </Text>, {nos:'4.7',},false,'控制系统'),
        crtOmni('联锁控制',{seco:'※K4.8',},undefined,
            <Text>(1)采用自动控制或者联锁控制时，在维修(维护)模式下，每个运动应当可单独控制。有防止误起动的控制措施。
            </Text>, {nos:'4.8',pre:'※',},false,'自动控制或者联锁控制'),
    ],'4.1电气设备安装-4.8自动控制或者联锁控制');
    pushOmni(ari,'4.9',[
        crtOmni('按钮信号',{bspan:7,span:1,seco:'K4.9',},undefined,
            <Text>(1)控制元件与操作台按钮应完好，并有明确标志；操作按钮应有相应的信号响应，指示灯应按照标识指示。
            </Text>, {nos:'4.9',},false,'控制元件及操作按钮、信号灯等标志和颜色'),
        crtOmni('停止按钮',{seco:'※K4.10',},undefined,
            <Text>(1)紧急停止按钮应符合设计文件及以下要求，紧急停止按钮应当设置在乘客不易触及的区域，必要时应当加防护隔离罩；操作台上应当设置紧急停止按钮(必要时站台上也应当设置)，按钮型式应当采
                用凸起手动复位式，按下紧急停止按钮不应造成人员伤害。
            </Text>, {nos:'4.10',pre:'※',},false,'紧急停止按钮及按钮型式'),
        crtOmni('乘客开关',{seco:'K4.11',},undefined,
            <Text>(1)由乘客操作的电器开关的电压应当不高于24V,对于工作电压难以满足要求的设备，其结构和外壳应当对意外触及带电零部件有足够的防护。
            </Text>, {nos:'4.11',},false,'乘客操作电器开关'),
        crtOmni('照明电压',{seco:'K4.12',},undefined,
            <Text>(1)乘客易接触部位的装饰照明电压应当不大于50V。
            </Text>, {nos:'4.12',},false,'装饰照明电压'),
        crtOmni('应急照明',{seco:'K4.13',},undefined,
            <Text>(1)根据实际工况应当有相应照明和应急照明设备。
            </Text>, {nos:'4.13',},false,'照明和应急照明'),
        crtOmni('音响信号',{seco:'K4.14',},undefined,
            <Text>(1)音响等信号装置应有效。
            </Text>, {nos:'4.14',},false,'音响和信号装置'),
        crtOmni('余电保护',{seco:'K4.15',},undefined,
            <Text>(1)电气设备应有标牌。安装在水泵房、游泳池等潮湿场所的电气设备以及使用非安全电压的装饰及照明设备应设有剩余电流动作保护装置，其技术参数额定值应当与被保护线路或者设备的技术参数
                及安装与运行环境相匹配。
            </Text>, {nos:'4.15',},false,'潮湿场所电气设备剩余电流动作保护装置'),
    ],'4.9按钮、信号灯等标志-4.15潮湿场所电气设备保护');
    //"sk":[{"no":"5.1","r":3,"bs":[12],"ss":[3],"vx":1},0,0,{"pr":"※","no":"5.4.1","ss":[7],"ts":[1],"r":0},{"pr":"※","r":0},{"pr":"※","r":0},{"pr":"※","ts":[4],"r":4,"vx":1}
    //生成后手动给自拆分项目首行上加 mergLabel :'';改动+加{seco:' ' }；
    pushOmni(ari,'5.1',[
        crtOmni('乘人结构',{big:'K5乘载系统检验',bspan:12,span:3,seco:'K5.1结构',},{seco:'K5.1',},
            <Text>(1)乘人装置结构应符合设计文件要求。
            </Text>, {nos:'5.1(1)',mergLabel:'结构'},true, '（1）乘人装置结构',),
        crtOmni('玻璃钢连',{},undefined,
            <Text>(2)玻璃钢件与结构件直接连接时应当有足够的强度，否则需要预埋满足强度要求的金属件。
            </Text>, {nos:'5.1(2)', },true, '（2）玻璃钢件与结构件的连接',),
        crtOmni('玻璃',{},undefined,
            <Text>(3)座舱门窗玻璃应采用不易破碎的材料。
            </Text>, {nos:'5.1(3)', mergNos:'5.1',mergName:'结构',},false, '（3）座舱门窗玻璃采用的材料',),
        crtOmni('座席',{seco:'K5.2',},undefined,
            <Text>(1)抽查测量相关尺寸，座席型式和尺寸应符合设计文件及以下要求。座席距地面最大高度5m以下时,座舱深度不小于550mm,座席靠背高度不小于300mm。座席距地面最大高度5m以上时,座舱深度
                不小于800mm,座席靠背高度不小于400mm。当设有安全杠和安全带等设施时,可适当减少座舱深度。乘人座席宽度每人应不小于400mm，专供儿童乘坐的每人应不小于250mm。
                <JumpMeasure tag={'Measure'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'5.2',},false,'座席尺寸和型式'),
        crtOmni('尖角毛刺',{seco:'K5.3',},undefined,
            <Text>(1)乘客可能触及之处应无有外露的锐边、尖角、毛刺和危险突出物等。
            </Text>, {nos:'5.3',},false,'尖角毛刺和危险突出物'),
        crtOmni('安全带',{seco:'K5.4乘客束缚装置',span:7,third:'※K5.4.1',tspan:1,},undefined,
            <Text>(1)安全带应符合设计文件及以下要求：安全带织带的宽度应当不小于30mm，安全带破断拉力应当不小于6000N，安全带的宽度和破断拉力还应当满足实际工况下束缚乘客的安全性要求，并且有相
                应的合格证明文件或者检测报告；安全带卡扣组件、安全带卡扣组件与安全带连接的破断拉力应当不小于6000N，安全带卡扣组件应当锁紧可靠，在无外力作用的情况下应当不能自行打开；安全带
                与机体的连接应当牢固可靠。单车滑行车系列、多车滑行车系列、弯月飞车系列、架空游览车类（封闭座舱不作要求）大型游乐设施采用安全挡杆作为主要束缚装置时只能由操作人员释放。
                <JumpMeasure tag={'Measure2'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'5.4.1',pre:'※',},false,'安全带'),
        crtOmni('安全把手',{third:'※K5.4.2',},undefined,
            <Text>(1)安全把手固定应牢固。
            </Text>, {nos:'5.4.2',pre:'※',},false,'安全把手'),
        crtOmni('安全挡杆',{third:'※K5.4.3',},undefined,
            <Text>(1)安全挡杆应能够规范乘客的乘坐姿势，其锁紧装置应符合设计文件要求。单车滑行车系列、多车滑行车系列、弯月飞车系列、架空游览车类（封闭座舱不作要求）大型游乐设施采用安全挡杆作为
                主要束缚装置时，乘客应当不能自行打开安全挡杆。
            </Text>, {nos:'5.4.3',pre:'※',},false,'安全挡杆'),
        crtOmni('压杠资料',{third:'※K5.4.4安全压杠',tspan:4,}, {third:'※K5.4.4'},
            <Text>(1)应有试验报告等相关资料和自检报告。
            </Text>, {nos:'5.4.4(1)',pre:'※',mergLabel:'安全压杠' },true, '（1）安全压杠资料',),
        crtOmni('被乘客开',{},undefined,
            <Text>(2)安全压杠在运行中不能自行开锁或者不会被乘客打开。
            </Text>, {nos:'5.4.4(2)',pre:'※', },true, '（2）运行中不能自行开锁或者不会被乘客打开',),
        crtOmni('压杠锁紧',{},undefined,
            <Text>(3)安全压杠及其锁紧装置应有效，安全压杆在压紧状态时端部游动量应符合设计文件要求。
            </Text>, {nos:'5.4.4(3)',pre:'※', },true, '（3）安全压杠及其锁紧装置',),
        crtOmni('压杠联锁',{},undefined,
            <Text>(4)具有自动联锁功能的，在自动运行模式下，分别单独触发闭合或者锁紧，起动按钮应不能起动设备；具有人工联锁功能的，站台应有人工确认按钮，并且在自动运行模式下不触发人工确认按钮，
                起动按钮应不能起动设备。
            </Text>, {nos:'5.4.4(4)',pre:'※', mergNos:'5.4.4',mergName:'压杠',},false, '（4）联锁功能',),
    ],'5.1乘人装置结构-5.4.4安全压杠联锁');
    //"sk":[{"pr":"※","no":"5.5.1","r":0,"bs":[3],"ss":[3],"ts":[1]},0,0,{"big":"","no":"6.1","bs":[6],"ss":[1],"r":0},{"pr":"※","r":5,"ss":[5],"vx":1}
    //手动加 mergLabel，seco， big；
    pushOmni(ari,'5.5.1',[
        crtOmni('安全距离',{bspan:3,seco:'K5.5安全距离和防护',span:3,third:'※K5.5.1',tspan:1,},undefined,
            <Text>(1)乘人部分与障碍物最近距离应符合设计文件及以下要求，凡乘客身体可伸到座舱以外时，应当设有防止乘客在运行中与周围障碍物相碰撞的安全保护装置或者留出足够的安全距离，防止乘客发生
                碰撞危险；运行速度较低时，安全距离可适当降低。
            </Text>, {nos:'5.5.1',pre:'※',},false,'安全距离'),
        crtOmni('距站台高',{third:'K5.5.2',},undefined,
            <Text>(1)乘人部分进出口到站台台面的垂直距离应符合设计文件及以下要求，乘人部分进出口距站台的高度，应当便于乘客上下。
            </Text>, {nos:'5.5.2',},false,'进出口距站台高度'),
        //【奇怪】WPS中PDF：直接复制这一个项目描述，竟然是乱序的，不是本该显示的位置顺序应当输出的文本字符流。【复制以后文本无法匹配屏幕中见到的正常文字顺序】
        //PDF ？ 诡异现象》 导致无法还原正常文本。
        crtOmni('台面间隙',{third:'K5.5.3',},undefined,
            <Text>(1)转动平台台面应有防滑措施，设有转动平台时，转动平台与固定部分之间的间隙应符合设计文件
                及以下要求，间隙应当合理，防止乘客脚部受到伤害；若平台高于站台面，其垂直方向的间隙应当
                适当，不应当对乘客的脚部造成危险;且应符合设计文件要求。
            </Text>, {nos:'5.5.3',},false,'转动平台台面及其间隙'),
        crtOmni('安保要求',{big:'K6安全保护装置和防护措施检验',bspan:6,span:1,seco:'K6.1',},undefined,
            <Text>(1)安全联锁装置、起动确认按钮、监控措施的设置等安全保护装置和防护措施应符合设计文件要求。
            </Text>, {nos:'6.1',},false,'一般要求'),
        crtOmni('制动资料',{span:5,seco:'※K6.2制动装置与制动距离',},{seco:'※K6.2',},
            <Text>(1)相关资料和自检报告应符合要求
            </Text>, {nos:'6.2(1)',pre:'※',mergLabel:'制动装置与制动距离' },true, '（1）制动装置资料',),
        crtOmni('制动结构',{},undefined,
            <Text>(2)制动装置的连接螺栓不应松动、结构件不应变形、固定位置不应偏移。
            </Text>, {nos:'6.2(2)',pre:'※', },true, '（2）制动装置连接、结构件、固定位置情况',),
        crtOmni('制动动作',{},undefined,
            <Text>(3)按照实际运行工况、断电工况进行试验，各种工况试验时制动装置应能够有效动作。
            </Text>, {nos:'6.2(3)',pre:'※', },true, '（3）制动装置动作',),
        crtOmni('制动距离',{},undefined,
            <Text>(4)在满载工况下最大速度运行时的制动距离，应符合设计文件要求。
                <JumpMeasure tag={'Measure2'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'6.2(4)',pre:'※', },true, '（4）制动距离',),
        crtOmni('制动磨损',{},undefined,
            <Text>(5)安装位置和安装方式应符合设计文件要求；对有磨损的机械式制动装置在磨损严重部位测量闸衬厚度，磨损量应当不大于原厚度50%且满足设计文件要求。
            </Text>, {nos:'6.2(5)',pre:'※', mergNos:'6.2',mergName:'制动装置',},false, '（5）安装位置和安装方式、磨损情况',),
    ],'5.5.1安全距离-6.2制动装置与制动距离');
    //"sk":[{"pr":"※","no":"6.4","r":0,"bs":[8],"ss":[1]},{"pr":"※","r":0},{"pr":"※","no":"6.7","r":0},{"pr":"※","r":0},{"no":"6.9.1","ss":[2],"ts":[1],"r":0},0,{"no":"6.12","ss":[1],"r":0},0
    pushOmni(ari,'6.4',[
        crtOmni('防超速',{bspan:8,span:1,seco:'※K6.4',},undefined,
            <Text>(1)有可能超速的大型游乐设施应当设有安全可靠的限速装置或者采取限速措施；防超速装置应有效。
            </Text>, {nos:'6.4',pre:'※',},false,'防超速控制装置'),
        crtOmni('限位装置',{seco:'※K6.5',},undefined,
            <Text>(1)大型游乐设施在运行中超过预定位置有可能发生危险时，应当设置限位装置，阻止其向不安全方向运行；必要时加装能切断总电源的极限位置开关。
            </Text>, {nos:'6.5',pre:'※',},false,'限位装置'),
        crtOmni('缓冲装置',{seco:'※K6.7',},undefined,
            <Text>(1)缓冲装置应当符合设计文件及以下要求，升降装置的极限位置，必要时应当设置缓冲装置，防止升降过程出现异常冲击和振动。
            </Text>, {nos:'6.7',pre:'※',},false,'缓冲装置'),
        crtOmni('舱门锁紧',{seco:'※K6.8',},undefined,
            <Text>(1)锁紧装置应符合设计文件要求，其锁紧情况及安装应牢固；距离地面有一定高度且人员有跌落伤害风险的封闭座舱，座舱门应当设置乘客在内部不能开启的两道锁紧装置或者一道带保险的锁紧装
                置，非封闭座舱进出口处的拦挡物，也应当有带保险的锁紧装置。
            </Text>, {nos:'6.8',pre:'※',},false,'乘人舱门锁紧装置'),
        crtOmni('吊挂保险',{seco:'K6.9保险措施',span:2,third:'K6.9.1',tspan:1,},undefined,
            <Text>(1)吊挂乘人部分应有保险措施。
            </Text>, {nos:'6.9.1',},false,'吊挂乘人部分保险措施'),
        crtOmni('吊舱保险',{third:'K6.9.2',},undefined,
            <Text>(1)吊舱吊挂应有保险措施。
            </Text>, {nos:'6.9.2',},false,'吊舱吊挂保险措施'),
        crtOmni('风速计',{span:1,seco:'K6.12',},undefined,
            <Text>(1)设备高度或者运行高度20m以上的室外大型游乐设施，应当设有风速计；风速计应当有方便操作人员观察的数据显示装置和报警功能。风速计应正常，其安装应符合设计文件要求。
            </Text>, {nos:'6.12',},false,'风速计'),
        crtOmni('防护罩',{seco:'K6.13',},undefined,
            <Text>(1)防护罩等机械安全防护应符合设计文件及以下要求，人员可触及的机械传动部件（如齿轮、皮带轮、联轴器等），应当有防护罩或者其他防护措施。
            </Text>, {nos:'6.13',},false,'防护罩等机械安全防护'),
    ],'6.4防超速控制装置-6.13防护罩等安全防护');
    //"sk":[{"no":"6.14","r":0,"bs":[10],"ss":[1]},0,{"pr":"※","no":"6.17","r":0},0,0,0,0,0,0, {"no":"6.25","r":0}
    pushOmni(ari,'6.14',[
        crtOmni('安全网',{bspan:10,span:1,seco:'K6.14',},undefined,
            <Text>(1)在易发生乘客、物体坠落从而导致（或造成）人员伤害的位置（或区域），应当设置安全网或者有相应的安全措施。安全网或者防坠设施（措施）应完好。
            </Text>, {nos:'6.14',},false,'安全网或者其他措施'),
        crtOmni('警示标',{seco:'K6.15',},undefined,
            <Text>(1)安全警示标志装设情况应规范、醒目、完好。
            </Text>, {nos:'6.15',},false,'安全警示标志'),
        crtOmni('断绳保',{seco:'※K6.17',},undefined,
            <Text>(1)断绳保护装置应有效。
            </Text>, {nos:'6.17',pre:'※',},false,'断绳保护装置'),
        crtOmni('操作室',{seco:'K6.18',},undefined,
            <Text>(1)操作室应单独设置，操作空间和照明应当满足操作需要，方便操作；在操作人员无法观察道运行情况并有可能发生危险的盲区，应当设置监视系统等安全措施；操作室视野应当开阔，操作室内不
                能观察到全部乘客上下情况且乘客束缚装置没有与起动按钮联锁的，应当在相应的位置设置起动确认联锁按钮。
            </Text>, {nos:'6.18',},false,'操作室'),
        crtOmni('站台设置',{seco:'K6.19',},undefined,
            <Text>(1)站台不应对设备运行产生干涉，运行时活动站台应处于锁死状态；站台高度应设置合理，应设置防滑措施。
            </Text>, {nos:'6.19',},false,'站台设置'),
        crtOmni('安全栅栏',{seco:'K6.20',},undefined,
            <Text>(1)栅栏的设置和栅栏高、间隙应符合设计文件的要求，且应符合如下要求：1）大型游乐设施周围及站台，应当设置安全栅栏或者其他有效的隔离设施，防止人员误入、跌落以及设备与站外人员发
                生肢体碰撞等；安全栅栏高度应当不低于1100mm；栅栏的间隙和距离地面的间隙应当不大于 120mm；安全栅栏应当设置为儿童不易攀爬的结构；
                2）安全栅栏应当分别设进出口，在进口处宜有引导栅栏；站台应当有防滑措施； 3）安全栅栏门开启方向应当与乘客行进方向一致(特殊情况除外) ；
                4）安全栅栏等门边框与立柱之间的间隙应当适当，或者采取其他防止夹手的措施。
                <JumpMeasure tag={'Measure2'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'6.20',},false,'安全栅栏设置'),
        crtOmni('装饰物',{seco:'K6.21',},undefined,
            <Text>(1)不应有未经设计校核的装饰物，经过设计校核的装饰物应固定完好。
            </Text>, {nos:'6.21',},false,'装饰物'),
        crtOmni('进出口',{seco:'K6.22',},undefined,
            <Text>(1)进出口台阶的宽度和高度、进出口的斜坡坡度应当方便人员出入；台阶踏面纵向宽度应当不小于240mm，高度为140mm～200mm；进出口为斜坡时，坡度应当不大于1:6，有防滑措施的斜坡，
                坡度应当不大于1:4；阶梯高度和坡度应当保持一致。
                <JumpMeasure tag={'Measure2'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'6.22',},false,'进出口'),
        crtOmni('疏导救援',{seco:'K6.23',},undefined,
            <Text>(1)审查相关资料和应急演练报告；进行应急救援模拟试验，疏散时间应满足法规要求。
            </Text>, {nos:'6.23',},false,'疏导乘客措施与应急救援'),
        crtOmni('备用电源',{seco:'K6.25',},undefined,
            <Text>(1)备用电源和救援设备数量、结构型式、连接方式应符合设计文件要求。外观不应破损缺失，结构不应有变形、损坏，功能应正常。
            </Text>, {nos:'6.25',},false,'备用电源和救援设备'),
    ],'6.14安全网或其他-6.25备用电源和救援设备');
    //"sk":[{"no":"7.1","r":2,"bs":[7],"ss":[2],"vx":1},0,0,{"no":"7.5","r":0},0,0
    pushOmni(ari,'7.1',[
        crtOmni('空载运',{big:'K7载荷试验与测试',bspan:7,span:2,seco:'K7.1空载运行试验',},{seco:'K7.1',},
            <Text>(1)审查受检单位提供的不少于2h的空载运行报告，该报告应符合如下要求：(1)设备的起动、换向、停机、制动和安全联锁等动作，均应当正确、灵敏、可靠；(2)整机应当运行正常，不允许有爬
                行和异常的振动、冲击、发热及声响；(3)各传动部件应当平稳，无异常振动、窜动、冲击、噪声、磨损和永久变形；(4)轴承温升及油箱油温应当符合设计要求；(5)齿轮及齿条传动不应当有偏啮合及
                偏磨损；(6)电气系统、控制系统应当工作正常；(7)润滑、液压(气动) 等辅助系统的工作应当正常，无渗漏现象；(8)零部件及其连接应当牢固可靠，不允许有永久变形和损坏现象；(9)起动和停止时立
                柱的导向装置应当无明显冲击和异常抖动现象；(10)靠摩擦力提升的设备，摩擦面之间不允许有明显的相对滑动；(11)正常工况下动态参数测试结果应当符合设计要求。
            </Text>, {nos:'7.1(1)', mergLabel:'空载运行试验'},true, '（1）空载运行报告',),
        crtOmni('空载试',{},undefined,
            <Text>(2)设备起、制动应平稳可靠，运行过程中不应爬行和异常的振动、冲击、发热和声响等现象。
            </Text>, {nos:'7.1(2)', mergNos:'7.1',mergName:'空载运行',},false, '（2）空载运行试验',),
        crtOmni('满载试验',{seco:'K7.2',},undefined,
            <Text>(1)审查受检单位提供的不少于16h的满载运行报告或者对型式试验证书覆盖范围内，与型式试验样机不一致的首台（套）大型游乐设施，受检单位提供不少于80h的满载运行报告，该报告应符合如下要求：(1)设备的起动、换
                向、停机、制动和安全联锁等动作，均应当正确、灵敏、可靠；(2)整机应当运行正常，不允许有爬行和异常的振动、冲击、发热及声响；(3)各传动部件应当平稳，无异常振动、窜动、冲击、噪声、磨损和永久变形；(4)轴
                承温升及油箱油温应当符合设计要求；(5)齿轮及齿条传动不应当有偏啮合及偏磨损；(6)电气系统、控制系统应当工作正常 ；(7)润滑、液压(气动) 等辅助系统的工作应当正常，无渗漏现象；(8)零部件及其连接应当牢固可
                靠，不允许有永久变形和损坏现象；(9)起动和停止时立柱的导向装置应当无明显冲击和异常抖动现象；(10)靠摩擦力提升的设备，摩擦面之间不允许有明显的相对滑动；(11)在额定载荷下，载人装置停在提升段任意位置，提
                升机构均应当能平稳起动；(12)正常工况下动态参数测试结果应当符合设计要求。 设备起、制动应平稳可靠，运行过程中不应爬行和异常的振动、冲击、发热和声响等现象。
            </Text>, {nos:'7.2',},false,'满载运行试验'),
        crtOmni('偏载试验',{seco:'K7.3',},undefined,
            <Text>(1)受检单位提供的偏载试验报告应符合如下要求：(1)设备的起动、换向、停机、制动和安全联锁等动作，均应当正确、灵敏、可靠；(2)整机应当运行正常，不允许有爬行和异常的振动、冲击、发热
                及声响；(3)各传动部件应当平稳，无异常振动、窜动、冲击、噪声、磨损和永久变形；(4)轴承温升及油箱油温应当符合设计要求；(5)齿轮及齿条传动不应当有偏啮合及偏磨损；(6)电气系统、控制系
                统应当工作正常；(7)润滑、液压(气动) 等辅助系统的工作应当正常，无渗漏现象；(8)零部件及其连接应当牢固可靠，不允许有永久变形和损坏现象；(9)起动和停止时立柱的导向装置应当无明显冲击
                和异常抖动现象；(10)靠摩擦力提升的设备，摩擦面之间不允许有明显的相对滑动；(11)正常工况下动态参数测试结果应当符合设计要求。
                设备起、制动应平稳可靠，运行过程中不应爬行和异常的振动、冲击、发热和声响等现象。
            </Text>, {nos:'7.3',},false,'偏载运行试验'),
        crtOmni('参数测试',{seco:'K7.5',},undefined,
            <Text>(1)主要技术参数测试值应符合设计文件要求，动态性能参数与设计计算值的偏差为-10％～5％。
                <JumpMeasure tag={'MainTechnical'} rep={rep}>附录A主要技术参数测试</JumpMeasure>
            </Text>, {nos:'7.5',},false,'主要技术参数测试'),
        crtOmni('应力测试',{seco:'K7.6',},undefined,
            <Text>(1)设计文件鉴定报告中有应力测试要求的或者运行中冲击较大或者存在安全隐患的设备，审查受检单位提供的应力测试报告，必要时对主要受力部件的应力进行抽查测试，测试结果应当满足设计文
                件要求。
                <JumpMeasure tag={'StrainStress'} rep={rep}>附录B 应力测试记录</JumpMeasure>
            </Text>, {nos:'7.6',},false,'应力测试'),
        crtOmni('加速度测',{seco:'K7.7',},undefined,
            <Text>(1)设计文件鉴定报告中有加速度测试要求的或者存在加速度安全隐患的设备，审查受检单位提供的加速度测试报告，必要时进行抽查测试，测试结果应当满足设计文件要求。
                <JumpMeasure tag={'Acceleration'} rep={rep}>附录C 加速度检测记录</JumpMeasure>
            </Text>, {nos:'7.7',},false,'加速度测试'),
    ],'7.1空载运行报告-7.7加速度测试');
    //"sk":[{"no":"8.1","r":2,"bs":[7],"ss":[2],"vx":1},{"r":2,"ss":[2],"vx":1},0,0,0
    pushOmni(ari,'8.1',[
        crtOmni('耐腐蚀',{big:'K8水上游乐设施专项检验',bspan:7,span:2,seco:'K8.1滑梯滑道材料',},{seco:'K8.1',},
            <Text>(1)水滑道应当采用玻璃钢或者不锈钢等耐腐蚀材料。
            </Text>, {nos:'8.1(1)', mergLabel:'滑梯滑道材料'},true, '（1）耐腐蚀材料',),
        crtOmni('强刚度',{},undefined,
            <Text>(2)水滑梯应当有足够的强度和刚度。
            </Text>, {nos:'8.1(2)', mergNos:'8.1',mergName:'滑道材料',},false, '（2）强度和刚度',),
        crtOmni('水滑道',{span:2,seco:'K8.2滑梯表面',},{seco:'K8.2',},
            <Text>(1)水滑道表面应当连续、光滑，接口处有过渡圆角，不应当有尖角、棱角、裂纹、非正常的孔洞、缝隙和变形等缺陷；沿滑行方向不应当有逆向阶差，顺向阶差应当不大于2mm，接缝处不允许漏水。
            </Text>, {nos:'8.2(1)', mergLabel:'滑梯表面'},true, '（1）水滑道表面',),
        crtOmni('孔洞缝',{},undefined,
            <Text>(2)身体滑梯中用于供水、特殊效果等用途的孔洞和缝隙，当乘员有可能触及时，孔洞的直径和缝隙的宽度应当不大于8mm，且有倒圆处理。
                <JumpMeasure tag={'Measure2'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'8.2(2)', mergNos:'8.2',mergName:'滑梯表面',},false, '（2）孔洞和缝隙',),
        crtOmni('防锈检',{seco:'K8.3',},undefined,
            <Text>(1)经常和水接触的零部件应当采用防锈材料或者采取防锈措施，不应当有严重锈蚀或者腐蚀。
            </Text>, {nos:'8.3',},false,'涉水零部件防锈检查'),
        crtOmni('梯剖面',{seco:'K8.4',},undefined,
            <Text>(1)滑梯剖面尺寸应当符合设计文件要求。
            </Text>, {nos:'8.4',},false,'滑梯剖面尺寸'),
        crtOmni('护板栏',{seco:'K8.5',},undefined,
            <Text>(1)乘员或者滑行工具在滑行过程中不应当超出水滑道护板的边缘，在敞开式滑梯内滑行方向变化和转弯处，水滑道外侧（或者内侧）应当设置护板，护板高度应当能防止乘员滑出。
            </Text>, {nos:'8.5',},false,'滑梯护板、护栏'),
    ],'8.1耐腐蚀材料-8.5滑梯护板、护栏');
    //"sk":[{"pr":"※","no":"8.6","r":0,"bs":[11],"ss":[1]},0,0,0,{"pr":"※","r":0},{"pr":"※","r":0},0,0,0,0,0
    pushOmni(ari,'8.6',[
        crtOmni('出口安距',{bspan:11,span:1,seco:'※K8.6',},undefined,
            <Text>(1)水滑梯溅落区和结束端应当有足够长度确保乘员安全停止滑行。
            </Text>, {nos:'8.6',pre:'※',},false,'滑梯出口安全距离'),
        crtOmni('多滑梯距',{seco:'K8.7',},undefined,
            <Text>(1)相邻水滑道侧边之间的距离应当不小于1.0m；并列多滑梯其相邻滑道中心线距离应当不小于900mm；敞开式单或者多滑梯边缘距周边障碍物的距离应当不小于500mm；敞开式滑道上方的任
                何物体距离滑槽截面最低点应当不小于1400mm。
                <JumpMeasure tag={'Measure2'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'8.7',},false,'多滑梯安全距离相关尺寸'),
        crtOmni('外梯壁距',{seco:'K8.8',},undefined,
            <Text>(1)身体滑梯、皮筏滑梯的侧边（靠池壁）到池壁水平距离应当分别不小于1.2m和1.5m。
            </Text>, {nos:'8.8',},false,'最外侧滑梯距水池侧壁水平距离'),
        crtOmni('末端高度',{seco:'K8.9',},undefined,
            <Text>(1)水滑梯末端滑落点距溅落区水面的高度应当不大于200mm；儿童滑梯末端滑落点距溅落区水面的高度应当不大于50mm；上抛入水的滑梯末端距溅落区水面高度应当不大于1200mm，上抛角度
                应当不大于30°。
                <JumpMeasure tag={'Measure3'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'8.9',},false,'滑梯末端距溅落区水面高度、角度'),
        crtOmni('下滑标牌',{seco:'※K8.10',},undefined,
            <Text>(1)水上游乐设施、游乐区域应当按照有关规定设置安全告示牌、安全警示标志，水滑梯应当在滑梯明显位置设置下滑方式标牌。
            </Text>, {nos:'8.10',pre:'※',},false,'下滑方式标牌检查'),
        crtOmni('起点杆高',{seco:'※K8.11',},undefined,
            <Text>(1)身体滑梯入口处应当设置高度为0.8m～1.1m的横杆，以防止乘员站立进入滑道。
                <JumpMeasure tag={'Measure3'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'8.11',pre:'※',},false,'起点处横杆高度'),
        crtOmni('滑行工具',{seco:'K8.12',},undefined,
            <Text>(1)滑行工具选型应当与滑梯型式匹配，其扶手应当牢固可靠，滑行工具采用充气方式时应当无漏气现象，且其充气压力应当符合使用维护保养说明书的要求。
            </Text>, {nos:'8.12',},false,'滑行工具'),
        crtOmni('滑行情况',{seco:'K8.13',},undefined,
            <Text>(1)滑行过程中，乘员不应当出现被抛出、坠落、翻滚、弹跳、腾空、碰撞、划伤、灼伤、滞留、挤夹等状况。
            </Text>, {nos:'8.13',},false,'滑行情况检查'),
        crtOmni('净空区域',{seco:'K8.14',},undefined,
            <Text>(1)水滑道周围应当有适当的净空区域，净空区域内不应当放置固定物体和结构，不可避免的物体应当放置在延伸的净空区域的范围之内，并设置表面光滑、形状规则、边缘圆角半径不小于100mm的
                防护装置。
                <JumpMeasure tag={'Measure3'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'8.14',},false,'净空区域检查'),
        crtOmni('滑行间隔',{seco:'K8.15',},undefined,
            <Text>(1)为防止乘员之间相互碰撞等危险，出发平台、结束端的服务人员应当配置适宜的联络与沟通工具，合理设定前后乘员（滑行工具）之间的间隔，保证乘客之间具有足够的安全距离。
            </Text>, {nos:'8.15',},false,'滑行间隔及联络工具'),
        crtOmni('润滑水',{seco:'K8.16',},undefined,
            <Text>(1)润滑水流量应当调节适当，满足润滑和适当的滑行速度。
            </Text>, {nos:'8.16',},false,'润滑水流量'),
    ],'8.6滑梯出口安全距离-8.16润滑水流量');
    //"sk":[{"no":"8.17","r":0,"bs":[9],"ss":[1]},0,0,0,0,{"r":2,"ss":[2],"vx":1},{"r":2,"ss":[2],"vx":1}
    pushOmni(ari,'8.17',[
        crtOmni('游池设置',{bspan:9,span:1,seco:'K8.17',},undefined,
            <Text>(1)各类游乐池应当分别设置，不应当混用，水域相连时应当设置隔离装置。
            </Text>, {nos:'8.17',},false,'各类游乐池的设置'),
        crtOmni('池表面',{seco:'K8.18',},undefined,
            <Text>(1)游乐池壁及池底不应当渗水，所有棱角及底角应当为圆弧形，池壁应当平整，池底应当防滑；预埋件不应当露出池底，如露出应当采取保护措施。
            </Text>, {nos:'8.18',},false,'游乐池表面质量'),
        crtOmni('回水口',{seco:'K8.19',},undefined,
            <Text>(1)水循环系统的水池回水口至少应当设置两套独立、固定、非专业人员不可以移动的安全格栅，格栅间隙应当小于8mm，间隙流速应当小于0.2m/s，且避免设置在游客活动水域；若因无法避让设
                置在游客可触及的池壁时，安全格栅间隙应当确保游客的手指等不易进入，并且在回水口格栅上部水线以上位置设置“危险、切勿靠近”等安全警示标志。
                <JumpMeasure tag={'Safetygap'} rep={rep}>附录D 安全格栅间隙流速</JumpMeasure>
            </Text>, {nos:'8.19',},false,'回水口'),
        crtOmni('池水深',{seco:'K8.20',},undefined,
            <Text>(1)水滑梯溅落区水深一般为0.8m～0.9m；儿童滑梯溅落区水深应当为0.3m～0.6m；特殊型式滑梯
                溅落区水深一般为0.9m～4m；池壁周围和池内水深变化地点，应当有醒目的水深标志。
            </Text>, {nos:'8.20',},false,'游乐池水深'),
        crtOmni('过滤净化',{seco:'K8.21',},undefined,
            <Text>(1)游乐池用水和水滑梯的润滑水应当设置相应能力的过滤、净化及消毒设备。
            </Text>, {nos:'8.21',},false,'游乐池过滤净化设备'),
        crtOmni('防滑措施',{span:2,seco:'K8.22水上游乐区域检查',},{seco:'K8.22',},
            <Text>(1)水上游乐区域供人员通行的地面应当采取防滑措施。
            </Text>, {nos:'8.22(1)',mergLabel:'水上游乐区域检查' },true, '（1）防滑措施',),
        crtOmni('照明',{},undefined,
            <Text>(2)水上游乐设施应当有充足的照明。
            </Text>, {nos:'8.22(2)', mergNos:'8.22',mergName:'游区检',},false, '（2）照明',),
        crtOmni('救生员',{span:2,seco:'K8.23救生人员、设备及措施',},{seco:'K8.23',},
            <Text>(1)水上游乐园区应当配备足够的救生员及相应的救生设备或者器具。
            </Text>, {nos:'8.23(1)', mergLabel:'救生人员、设备及措施'},true, '（1）救生员及相应的救生设备或者器具',),
        crtOmni('疏散口',{},undefined,
            <Text>(2)对于封闭式滑梯，乘客滑行过程中，如可能发生意外停滞在滑梯内时，应当设有紧急疏散口。
            </Text>, {nos:'8.23(2)', mergNos:'8.23',mergName:'救生',},false, '（2）紧急疏散口',),
    ],'8.17各类游乐池设置-8.23救生人员设备措施');
    //"sk":[{"no":"8.24(1)","r":0,"bs":[6],"ss":[6]},0,0,0,0,0
    //再删多余seco；新增加参数 rtspan 配合 mergLabel；
    pushOmni(ari,'8.24',[
        crtOmni('隔离防护',{bspan:6,span:6,seco:'K8.24峡谷漂流系列专项检查',},{seco:'K8.24',},
            <Text>(1)峡谷漂流的泵站等蓄水深度较深及供排水、供电等区域，应当与游客活动区域有效隔离；在设备运行区域可能触碰的电气设备及电线电缆，应当设置有效的防护措施；泵站等蓄水深度较深的位
                置，应当与运行水道有效隔离；水泵进出水口应当设置间隔不大于100mm的防护栅栏。
            </Text>, {nos:'8.24(1)', mergLabel:'峡谷漂流系列专项检查', rtspan:6},false,'（1）区域隔离与防护措施检查'),
        crtOmni('水位刻度',{ },undefined,
            <Text>(2)漂流设施的水量应当保持在设计要求范围之内；峡谷漂流水道的水深应当不大于1.2m；筏体不应当有碰刮水槽底部或者水底装置等现象；在站台附近的水道内壁明显处，应当设有水位刻度尺。
                <JumpMeasure tag={'Measure3'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'8.24(2)',},false,'（2）水量、水深及水位刻度尺'),
        crtOmni('水循环系',{ },undefined,
            <Text>(3)漂流水道设计坡度应当合理，转弯半径应当适宜；漂流水道内壁应当光滑平顺，不应当有尖角，突变等影响漂流筏运行或者乘客安全的缺陷；水道上方和两侧不应当有影响乘客人身安全的凸起和
                障碍；水道底部造浪等装置的固定应当可靠；水道设计应当考虑温度变化对水道结构的影响；水循环系统设计应当合理。
            </Text>, {nos:'8.24(3)',},false,'（3）水道与水循环系统检查'),
        crtOmni('筏体',{ },undefined,
            <Text>(4)漂流筏的筏体应当结实耐用，腔体内宜采用致密性发泡材料填充；筏胎采用充气胎时，气室数量应当不少于6个，应当无明显漏气现象；充气胎应当在正常工况和局部破损情况下不会导致漂流筏倾
                覆；漂流筏踏脚平面和出入口应当设有防滑措施。
            </Text>, {nos:'8.24(4)',},false,'（4）漂流筏的筏体'),
        crtOmni('筏试验',{ },undefined,
            <Text>(5)漂流筏运行时与水道间应当无影响人员乘坐安全的冲击碰撞；筏体运行速度在进入提升、进站等处应当与提升、停船装置相匹配；筏体在漂流过程中不应当有倾覆、相碰撞的可能。
            </Text>, {nos:'8.24(5)',},false,'（5）运行试验'),
        crtOmni('自动控制',{ },undefined,
            <Text>(6)峡谷漂流的控制系统应当满足大型游乐设施运行工况和乘客安全的要求，控制逻辑应当可靠合理，控制系统故障不应当造成人员伤害；发船间隔应当设有自动控制功能。
            </Text>, {nos:'8.24(6)',},false,'（6）电气控制系统与自动控制功能'),
    ],'8.24 峡谷漂流系列专项检查');
    //"sk":[{"no":"8.25(1)","r":0,"bs":[13],"ss":[13]},0,0,0,0,0,0 ,0,0,0,0,0,0
    pushOmni(ari,'8.25',[
        crtOmni('船体稳定',{bspan:13,span:13,seco:'K8.25碰碰船系列专项检查',},{seco:'K8.25',},
            <Text>(1)船体在构造上应当有足够的稳定性，船体不得渗漏。
            </Text>, {nos:'8.25(1)', mergLabel:'碰碰船系列专项检查', rtspan:13},false,'（1）船体稳定性，船体不得渗漏'),
        crtOmni('碰撞保护',{},undefined,
            <Text>(2)船体应当有承受碰撞的保护装置。
            </Text>, {nos:'8.25(2)',},false,'（2）船体保护装置'),
        crtOmni('扶手座席',{},undefined,
            <Text>(3)船上应当设安全扶手，座席结构应当固定牢固。
            </Text>, {nos:'8.25(3)',},false,'（3）安全扶手及座席检查'),
        crtOmni('客救生衣',{},undefined,
            <Text>(4)碰碰船应当为乘客配备救生衣。
            </Text>, {nos:'8.25(4)',},false,'（4）应为乘客配备救生衣'),
        crtOmni('船沿距水',{},undefined,
            <Text>(5)按照实际工况在船体内加入额定载荷，碰碰船船沿至水面距离不得小于300mm。
                <JumpMeasure tag={'Measure3'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'8.25(5)',},false,'（5）额定载荷时船沿至水面距离检查'),
        crtOmni('偏载行试',{},undefined,
            <Text>(6)在船的一侧加入满载时不会倾翻。
            </Text>, {nos:'8.25(6)',},false,'（6）偏载运行试验'),
        crtOmni('碰撞试',{},undefined,
            <Text>(7)碰撞试验：两碰碰船全速运行相撞后不会倾翻。
            </Text>, {nos:'8.25(7)',},false,'（7）碰撞试验'),
        crtOmni('最行驶速',{},undefined,
            <Text>(8)碰碰船最大行驶速度应当小于10km/h。
                <JumpMeasure tag={'Maxspeed'} rep={rep}>附录E 船最大行驶速度</JumpMeasure>
            </Text>, {nos:'8.25(8)',},false,'（8）最大行驶速度'),
        crtOmni('浮圈气压',{},undefined,
            <Text>(9)碰碰船浮圈的充气压力应当不大于0.3MPa。
            </Text>, {nos:'8.25(9)',},false,'（9）浮圈的充气压力'),
        crtOmni('发动机检',{},undefined,
            <Text>(10)碰碰船所选发动机应当易于起动且运转可靠，并安装牢固，安装处应当具有足够刚性。
            </Text>, {nos:'8.25(10)',},false,'（10）发动机检查'),
        crtOmni('水池水深',{},undefined,
            <Text>(11)碰碰船水池水深应当不大于1.5m。
                <JumpMeasure tag={'Measure3'} rep={rep}>八、观测数据及测量结果</JumpMeasure>
            </Text>, {nos:'8.25(11)',},false,'（11）碰碰船水池水深'),
        crtOmni('动力防护',{},undefined,
            <Text>(12)船的动力部分和传动装置，应当采用遮挡物与乘客严格分开。
            </Text>, {nos:'8.25(12)',},false,'（12）动力部分和传动装置防护'),
        crtOmni('限制区驶',{},undefined,
            <Text>(13)碰碰船必须在限制的水域内行驶，不得与其他船只混杂在一起。
            </Text>, {nos:'8.25(13)',},false,'（13）限制区域内行驶'),
    ],'8.25 碰碰船系列专项检查');

    if (!noDefault) ari = omniCalculateDefault(ari, {iclasDefault: "K", displayDefault: true});
    return {Item: ari,} as { [key: string]: any[] };
};
