/** @jsxImportSource @emotion/react */
import * as React from "react";
import {
    Text,  CCell, Table, TableBody, TableRow,
} from "customize-easy-ui-component";
import { Link as RouterLink, } from "../../../routing/Link";
import {crtIof, pushItems, crtSpan, crtIofRss, crtRss, crtIofRssT, crtIofC, crtIofRssC} from "../../common/config";

/**配置检验项目。
 * 【这个版本的缺点】还是太把项目编号x.y.z.t太当回事了，约束太深了。 大标题会自动地去拆分，几个出现一次大标题的span，感觉大标题分解很多TD区块，还会出现修正span的格子TD高度的需求。若走**Rss*函数是自拆分的模式。 crtIof/C()是普通项目的。
 * 【不同点】自拆分和普通项目的构造函数不通用的，修改移植麻烦点。此刻还不支持name自动查唯一性做法？ 【内部】会进行反向的搜索配置。x y z t参数继承和参数倒置缺省。
 * 【对比缺点】配置文件地可阅读可比较能力不好。自拆分必须限制一个编辑区块内部做。
 * */
export const setupItemAreaRoute= ({verId, repId, theme} :{verId:string, repId:string,theme:any}
) => {
    let ari: any[] =[];
    //按照路由器分解的颗粒度来分别拼凑的装？ 【对应了】原始记录一个区块概念的。正式报告 不显示的或者映射合并项的？
    pushItems(ari,'1.1',
        [crtIofRssT([crtRss('制造许可',<Text>（1）制造许可证明文件，许可范围能够覆盖受检电梯的相应参数；</Text>,'(1)制造许可证明文件'),
                    crtRss('型试书',<Text>（2）电梯整机型式试验证书，其参数范围和配置表适用于受检电梯；</Text>,'(2)整机型式试验证书'),
                 crtRss('质量文',<Text>（3）产品质量证明文件，注有制造许可证明文件编号、产品编号、主要技术参数，限速器、安全钳、缓冲器、含有电子元件的安全电路(如果有)、可编程电子 安全相关系统(如果有)、轿厢上行超速保护装置(如果有)、轿厢意外移动保护装置、驱动主机、控制柜的型号和编号，门锁装置、层门和玻璃轿门(如果有)的型号，以及悬挂装置的名称、型号、主要参数(如直径、数量)，并且有电梯整机制造单位的公章或者检验专用章以及制造日期；
                        </Text>,'(3)产品质量证明文件'),
                crtRss('安全资料',<Text>（4）门锁装置、限速器、安全钳、缓冲器、含有电子元件的安全电路(如果有)、可编程电子安全相关系统(如果有)、轿厢上行超速保护装置(如果有)、轿厢意外移动保护装置、驱动主机、控制柜、层门和玻璃轿门(如果有)的型式试验证书，以及限速器和渐进式安全钳的调试证书；
                    </Text>,'(4)安全保护装置、主要部件型式试验证书及有关资料'),
                crtRss('原理图',<Text>（5）电气原理图，包括动力电路和连接电气安全装置的电路；</Text>,'(5)电气原理图'),
                crtRss('说明书',<Text>（6）安装使用维护说明书，包括安装、使用、日常维护保养和应急救援等方面操作说明的内容。</Text>,'(6)安装使用维护说明书'),
                ], '制造资料', <Text>电梯制造单位提供了以下用中文描述的出厂随机文件：</Text>,
                        <Text>注A-1：上述文件如为复印件则必须经电梯整机制造单位加盖公章或者检验专用章；对于进口电梯，则应当加盖国内代理商的公章或者检验专用章</Text>,
                 undefined,0,'',1,'制造资料',1,'技术资料'),
            crtIofRssT([crtRss('告知书',<Text>（1）安装许可证明文件和安装告知书，许可证范围能够覆盖受检电梯的相应参数；</Text>,'(1)安装许可证明文件和告知书'),
                    crtRss('施工案',<Text>（2）施工方案，审批手续齐全；</Text>,'(2)施工方案'),
                    crtRss('勘测图',<Text>（3）用于安装该电梯的机房(机器设备间)、井道的布置图或者土建工程勘测图，有安装单位确认符合要求的声明和公章或者检验专用章，表明其通道、通道门、井道顶部空间、底坑空间、楼层间距、井道内防护、安全距离、井道下方人可以到达的空间等满足安全要求；
                        </Text>,'(3)机房(机器设备间)和井道布置图或者勘测图'),
                    crtRss('自检报',<Text>（4）施工过程记录和由整机制造单位出具或者确认的自检报告，检查和试验项目齐全、内容完整，施工和验收手续齐全；</Text>,'(4)施工过程记录和自检报告'),
                    crtRss('设计证明',<Text>（5）变更设计证明文件（如安装中变更设计时），履行了由使用单位提出、经电梯整机制造单位同意的程序；</Text>,'(5)变更设计证明文件'),
                    crtRss('安装质量',<Text>（6）安装质量证明文件，包括电梯安装合同编号、安装单位安装许可证明文件编号、产品编号、主要技术参数等内容，并且有安装单位公章或者检验专用章以及竣工日期。</Text>,'(6)安装质量证明文件'),
                ], '安装资料', <Text>安装单位提供了以下安装资料：</Text>,
                <Text>注A-2：上述文件如为复印件则必须经安装单位加盖公章或者检验专用章</Text>,
                undefined,0,'',2,'安装资料',),
        ],'A','1.1制造资料-1.2安装资料');
    pushItems(ari,'1.3',
        [crtIofRssT([crtRss('告知书改',<Text>（1）改造或者修理许可证明文件和改造或者重大修理告知书，许可证范围能够覆盖受检电梯的相应参数；</Text>,'(1)改造(修理)许可证明文件和告知书'),
                crtRss('施工案改',<Text>（2）改造或者重大修理的清单以及施工方案，施工方案的审批手续齐全；</Text>,'(2)改造(重大修理)清单和施工方案'),
                crtRss('型试书改',<Text>（3）加装或者更换的安全保护装置或者主要部件产品质量证明文件、型式试验证书以及限速器和渐进式安全钳的调试证书(如发生更换)；</Text>,'(3)加装、更换的安全保护装置、主要部件的型式试验证书及有关资料'),
                crtRss('节能资料',<Text>（4）拟加装的自动救援操作装置、能量回馈节能装置、IC卡系统的下述资料(属于重大修理时)：<br/> ①加装方案(含电气原理图和接线图)；<br/> ②产品质量证明文件，标明产品型号、产品编号、主要技术参数，并且有产品制造单位的公章或者检验专用章以及制造日期；
                     <br/>③安装使用维护说明书，包括安装、使用、日常维护保养以及与应急救援操作方面有关的说明。</Text>,'(4)自动救援操作装置、能量回馈节能装置、IC 卡系统的资料'),
                crtRss('施作人证',<Text>（5）施工现场作业人员持有的特种设备作业人员证；</Text>,'(5)特种设备作业人员证'),
                crtRss('自检报改',<Text>（6）施工过程记录和自检报告，检查和试验项目齐全、内容完整，施工和验收手续齐全；</Text>,'(6)施工过程记录和自检报告'),
                crtRss('质量文改',<Text>（7）改造或者重大修理质量证明文件，包括电梯的改造或者重大修理合同编号、改造或者重大修理单位的许可证明文件编号、电梯使用登记编号、主要技术参数等内容，并且有改造或者重大修理单位的公章或者检验专用章以及竣工日期。
                            </Text>,'(7)改造(重大修理)质量证明文件'),
              ], '改修资料', <Text>改造或者重大修理单位提供了以下改造或者重大修理资料：</Text>,
                 <Text>注A-3：上述文件如为复印件则必须经改造或者重大修理单位加盖公章或者检验专用章</Text>,
                  undefined,0,'',3,'改造、重大修理资料',1),
              { ...crtIofRss([crtRss('使用登记',<Text>（1）使用登记资料，内容与实物相符；</Text>,'(1)使用登记资料'),
                        crtRss('技术档案',<Text>（2）安全技术档案，至少包括1.1、1.2、1.3所述文件资料 [1.3(5)除外]，以及监督检验报告、定期检验报告、日常检查与使用状况记录、日常维护保养记录、年度自行检查记录或者报告、应急救援演习记录、运行故障和事故记录等，保存完好
                                        （本规则实施前已经完成安装、改造或重大修理的，1.1、1.2、1.3项所述文件资料如有缺陷，应当由使用单位联系相关单位予以完善，可不作为本项审核结论的否决内容）；</Text>,'(2)安全技术档案'),
                        crtRss('管理规章',<Text>（3）以岗位责任制为核心的电梯运行管理规章制度，包括事故与故障的应急措施和救援预案、电梯钥匙使用管理制度等；</Text>,'(3)管理规章制度'),
                        crtRss('保养合同',<Text>（4）与取得相应资质单位签订的日常维护保养合同；</Text>,'(4)日常维护保养合同'),
                        crtRss('作业人证',<Text>（5）按照规定配备的电梯安全管理人员的特种设备作业人员证</Text>,'(5)特种设备作业人员证'),
                    ], '使用资料', <Text>使用单位提供了以下资料：</Text>,
                          undefined,0,'',4,'使用资料',) ,
                    iclas: 'B',
             },
        ],'A','1.3改造、重大修理资料-1.4使用资料');
    pushItems(ari,'2.1',
        [crtIofRssC([crtRss('通道设置',<Text>（1）应当在任何情况下均能够安全方便地使用通道。采用梯子作为通道时，必须符合以下条件：<br/> ①通往机房(机器设备间)的通道不应当高出楼梯所到平面4m；<br/>
                                   ②梯子必须固定在通道上而不能被移动； <br/>③梯子高度超过1.50m时，其与水平方向的夹角应当在65°～75°之间，并不易滑动或者翻转；<br/> ④靠近梯子顶端应当设置容易握住的把手。
                            <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationRoom`}>
                                <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                            </RouterLink>
                        </Text>,'(1)通道设置'),
                crtRss('通道照明',<Text>（2）通道应当设置永久性电气照明；</Text>,'(2)通道照明'),
                crtRss('通道门',<Text>（3）机房通道门的宽度应当不小于0.60m，高度应当不小于1.80m，并且门不得向机房内开启。门应当装有带钥匙的锁，并且可以从机房内不用钥匙打开。门外侧有下述或者类似的警示标志：“电梯机器——危险 未经允许禁止入内”
                        <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationRoom`}>
                            <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                        </RouterLink>
                    </Text>,'(3)通道门'),
            ], '与通道门',null,
            undefined,crtSpan(3,3,0,{bH:4}),undefined,0,'',1,'通道与通道门',2,'机房（机器设备间）及相关设备'),
            crtIof(crtSpan(1,1,0,{bH:3}),'房专用',<Text>（1）机房（机器设备间）应当专用，不得用于电梯以外的其他用途</Text> ,0,'',2,'机房(机器设备间)专用',),
            {
                ...crtIofRss([crtRss('净空柜前', <Text>（1）在控制柜前有一块净空面积，其深度不小于0.70m，宽度为0.50
                        m或者控制柜全宽（两者中的大值），净高度不小于2m；</Text>, '(1)控制柜前的净空面积'),
                        crtRss('净空维修',
                            <Text>（2）对运动部件进行维修和检查以及紧急操作的地方有一块不小于0.50m×0.60m的水平净空面积，其净高度不小于2m；</Text>, '(2)维修、操作处的净空面积'),
                        crtRss('梯护栏',
                            <Text>（3）机房地面高度不一并且相差大于0.50m时，应当设置楼梯或者台阶，并且设置护栏
                                <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationRoom`}>
                                    <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                                </RouterLink>
                            </Text>, '(3)楼梯（台阶）、护栏'),
                    ], '安全空间', null,
                    undefined, 0, '', 3, '安全空间',),
                span:{bH:8},
            },
            crtIof(crtSpan(1,1,0,{bH:3}),'地开口',<Text>（1）机房地面上的开口应当尽可能小，位于井道上方的开口必须采用圈框，此圈框应当凸出地面至少50mm
                        <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationRoom`}>
                            <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                        </RouterLink>
                </Text> ,0,'',4,'地面开口',),
            {
                ...crtIofRss([crtRss('照明开',
                        <Text>（1）机房(机器设备间)设有永久性电气照明；在靠近入口(或者多个入口)处的适当高度设置一个开关，控制机房(机器设备间)照明；</Text>, '(1)照明、照明开关'),
                        crtRss('电插座', <Text>（2）机房应当至少设置一个2P＋PE型电源插座；</Text>, '(2)电源插座'),
                        crtRss('轿厢照',
                            <Text>（3）应当在主开关旁设置控制井道照明、轿厢照明和插座电路电源的开关</Text>, '(3)井道、轿厢照明和插座电源开关'),
                    ], '与插座', null,
                    undefined, 0, '', 5, '照明与插座',),
                span:{bH:6},
            },
            crtIofRssC([crtRss('开关设',<Text>（1）每台电梯应当单独装设主开关，主开关应当易于接近和操作；</Text>,'(1)主开关设置'),
                    crtRss('照明控制',<Text>（2）主开关不得切断轿厢照明和通风、机房（机器设备间）照明和电源插座、轿顶与底坑的电源插座、电梯井道照明、报警装置的供电电路；</Text>,'(2)与照明等电路的控制关系'),
                    crtRss('误操作',<Text>（3）主开关应当具有稳定的断开和闭合位置，并且在断开位置时能用挂锁或其他等效装置锁住，能够有效的防止误操作；</Text>,'(3)防止误操作装置'),
                    crtRss('标志',<Text>（4）如果不同电梯的部件共用一个机房，则每台电梯的主开关应当与驱动主机、控制柜、限速器等采用相同的标志</Text>,'(4)标志'),
                ], '主开关',null,
                    'B',crtSpan(4,4,0,{bH:-1}),undefined,0,'',6,'主开关',),
        ],'C','2.1通道与通道门-2.6主开关');
    pushItems(ari,'2.7',
        [crtIofRss([crtRss('铭牌驱动',<Text>（1）驱动主机上设有铭牌，标明制造单位名称、型号、编号、技术参数和型式试验机构的名称或者标志，铭牌和型式试验证书内容相符；</Text>,'(1)铭牌'),
                crtRss('主机工况',<Text>（2）驱动主机工作时无异常噪声和振动；</Text>,'(2)工作状况'),
                crtRss('轮槽磨',<Text>（3）曳引轮轮槽不得有缺损或者不正常磨损；如果轮槽的磨损可能影响曳引能力时，进行曳引能力验证试验；</Text>,'(3)轮槽磨损'),
                crtRss('制动器情',<Text>（4）制动器动作灵活，制动时制动闸瓦(制动钳)紧密、均匀地贴合在制动轮(制动盘)上，电梯运行时制动闸瓦(制动钳)与制动轮(制动盘)不发生摩擦，制动闸瓦(制动钳)以及制动轮(制动盘)工作面上没有油污；
                            </Text>,'(4)制动器动作情况'),
                crtRss('手动装',<Text>（5）手动紧急操作装置符合以下要求：<br/>①对于可拆卸盘车手轮，设有一个电气安全装置，最迟在盘车手轮装上电梯驱动主机时动作；<br/>
                        ②松闸扳手涂成红色，盘车手轮是无辐条的并且涂成黄色，可拆卸盘车手轮放置在机房内容易接近的明显部位；<br/>③在电梯驱动主机上接近盘车手轮处，明显标出轿厢运行方向，如果手轮是不可拆卸的，可以在手轮上标出；<br/>
                        ④能够通过操纵手动松闸装置松开制动器，并且需要以一个持续力保持其松开状态；<br/>⑤进行手动紧急操作时，易于观察到轿厢是否在开锁区
                    </Text>,'(5)手动紧急操作装置'),
            ], '驱动主机',null,
                   undefined,0,'',7,'驱动主机',),
            crtIofRssC([crtRss('铭牌柜',<Text>（1）控制柜上设有铭牌，标明制造单位名称、型号、编号、技术参数和型式试验机构的名称或者标志，铭牌和型式试验证书内容相符；</Text>,'(1)铭牌'),
                    crtRss('断错相',<Text>（2）断相、错相保护功能有效，电梯运行与相序无关时，可以不设错相保护；</Text>,'(2)断错相保护'),
                    crtRss('制动电气',<Text>（3）电梯正常运行时，切断制动器电流至少用两个独立的电气装置来实现，当电梯停止时，如果其中一个接触器的主触点未打开，最迟到下一次运行方向改变时，应当防止电梯再运行；</Text>,'(3)制动器电气装置设置'),
                    crtRss('紧急电',<Text>（4）紧急电动运行装置应当符合以下要求： <br/>①依靠持续揿压按钮来控制轿厢运行，此按钮有防止误操作的保护，按钮上或者其近旁标出相应的运行方向；<br/>
                            ②一旦进入检修运行，紧急电动运行装置控制轿厢运行的功能由检修控制装置所取代；<br/>③进行紧急电动运行操作时，易于观察到轿厢是否在开锁区</Text>,'(4)紧急电动运行装置'),
                    crtRss('旁路装',<Text>（6）层门和轿门旁路装置应当符合以下要求：<br/>①在层门和轿门旁路装置上或者其附近标明‘旁路’字样，并且标明旁路装置的‘旁路’状态或者‘关’状态；<br/>
                        ②旁路时取消正常运行(包括动力操作的自动门的任何运行)；只有在检修运行或者紧急电动运行状态下，轿厢才能够运行；运行期间，轿厢上的听觉信号和轿底的闪烁灯起作用；<br/>
                        ③能够旁路层门关闭触点、层门门锁触点、轿门关闭触点、轿门门锁触点；不能同时旁路层门和轿门的触点；对于手动层门，不能同时旁路层门关闭触点和层门门锁触点；<br/>
                        ④提供独立的监控信号证实轿门处于关闭位置；</Text>,'(6)层门和轿门旁路装置'),
                    crtRss('门回路',<Text>（7）应当具有门回路检测功能，当轿厢在开锁区域内、轿门开启并且层门门锁释放时，监测检查轿门关闭位置的电气安全装置、检查层门门锁锁紧位置的电气安全装置和轿门监控信号的正确动作；如果监测到上述装置的故障，能够防止电梯的正常运行；
                                </Text>,'(7)门回路检测功能'),
                    crtRss('制动故障',<Text>（8）应当具有制动器故障保护功能，当监测到制动器的提起(或者释放)失效时，能够防止电梯的正常启动；</Text>,'(8)制动器故障保护'),
                    crtRss('救援装',<Text>（9）自动救援操作装置(如果有)应当符合以下要求：<br/>①设有铭牌，标明制造单位名称、产品型号、产品编号、主要技术参数；加装的自动救援操作装置的铭牌和该装置的产品质量证明文件相符；<br/>
                        ②在外电网断电至少等待3s后自动投入救援运行，电梯自动平层并且开门；<br/>③当电梯处于检修运行、紧急电动运行、电气安全装置动作或者主开关断开时，不得投入救援运行；<br/>
                        ④设有一个非自动复位的开关，当该开关处于关闭状态时，该装置不能启动救援运行；</Text>,'(9)自动救援操作装置'),
                    crtRss('节能装',<Text>（10）加装的分体式能量回馈节能装置应当设有铭牌，标明制造单位名称、产品型号、产品编号、主要技术参数，铭牌和该装置的产品质量证明文件相符；</Text>,'(10)分体式能量回馈节能装置'),
                    crtRss('IC卡',<Text>（11）加装的IC卡系统应当设有铭牌，标明制造单位名称、产品型号、产品编号、主要技术参数，铭牌和该系统的产品质量证明文件相符</Text>,'(11)IC卡系统'),
                ], '控制柜',null,
                'B',crtSpan(10,10,0,{bH:-1}),undefined,0,'',8,'控制柜、紧急操作和动态测试装置',) ,
        ],'B','2.7驱动主机-2.8控制柜、紧急操作和动态测试装置');
    pushItems(ari,'2.9',
        [crtIofRss([crtRss('铭牌限速',<Text>（1）限速器上设有铭牌，标明制造单位名称、型号、编号、技术参数和型式试验机构的名称或者标志，铭牌和型式试验证书、调试证书内容相符，并且铭牌上标注的限速器动作速度与受检电梯相适应；
                        </Text>,'(1)铭牌'),
                crtRss('电气安全',<Text>（2）限速器或者其他装置上设有在轿厢上行或者下行速度达到限速器动作速度之前动作的电气安全装置，以及验证限速器复位状态的电气安全装置；</Text>,'(2)电气安全装置'),
                crtRss('封记',<Text>（3）限速器各调节部位封记完好，运转时不得出现碰擦、卡阻、转动不灵活等现象，动作正常</Text>,'(3)封记及运转情况'),
                crtRss('速度校验',<Text>（4）受检电梯的维护保养单位应当每2年(对于使用年限不超过15年的限速器)或者每年(对于使用年限超过15年的限速器)进行一次限速器动作速度校验，校验结果应当符合要求</Text>,'(4)动作速度校验'),
            ], '限速器',null,undefined,0,'',9,'限速器',),
            crtIofRssC([crtRss('中性导',<Text>（1）供电电源自进入机房（机器设备间）起，中性导体（N，零线）与保护导体（PE，地线）应当始终分开；</Text>, '(1)中性导体与保护导体的设置'),
                    crtRss('接地连接',<Text>（2）所有电气设备及线管、线槽的外露可以导电部分应当与保护导体（PE，地线）可靠连接</Text>, '(2)接地连接'),
                ], '接地', null,'C',crtSpan(2,2,0,{bH:5}), undefined, 0, '', 10, '接地',),
            crtIofC(crtSpan(1,1,0,),'电气绝缘',<div><Text>（1）动力电路、照明电路和电气安全装置电路的绝缘电阻应当符合下述要求：</Text>
                <Table tight  miniw={800}><TableBody>
                    <TableRow>
                        <CCell>标称电压</CCell><CCell>测试电压（直流）/V</CCell><CCell>绝缘电阻/MΩ</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>安全电压</CCell><CCell>250</CCell><CCell>≥0.25</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>≤500</CCell><CCell>500</CCell><CCell>≥0.50</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>＞500</CCell><CCell>1000</CCell><CCell>≥1.00</CCell>
                    </TableRow>
                </TableBody></Table>
                <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationRoom`}>
                    <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                </RouterLink>
            </div>, 'C',0,'',11,'电气绝缘',),
            crtIofRssC([crtRss('铭牌超保',<Text>（1）轿厢上行超速保护装置上应当设有铭牌，标明制造单位名称、型号、编号、技术参数和型式试验机构名称或者标志，铭牌和型式试验证书内容相符；
                                 </Text>, '(1)铭牌'),
                crtRss('试验超保', <Text>（2）控制屏或者紧急操作和动态测试装置上标注电梯整机制造单位规定的轿厢上行超速保护装置动作试验方法</Text>, '(2)试验方法'),
            ], '厢上超速', null, undefined,crtSpan(2,2,0,{bH:6}),undefined, 0, '', 12, '轿厢上行超速保护装置',),
            crtIofRssC([crtRss('铭牌意外',<Text>（1）轿厢意外移动保护装置上设有铭牌，标明制造单位名称、型号、编号、技术参数和型式试验机构的名称或者标志，铭牌和型式试验证书内容相符；
                              </Text>, '(1)铭牌'),
                crtRss('试验意外', <Text>（2）控制柜或者紧急操作和动态测试装置上标注电梯整机制造单位规定的轿厢意外移动保护装置动作试验方法，该方法与型式试验证书所标注的方法一致</Text>, '(2)试验方法'),
            ], '厢意外移', null, undefined,crtSpan(2,2,0,{bH:7}),undefined, 0, '', 13, '轿厢意外移动保护装置',),
            crtIofC(crtSpan(1,1,0,{bH:1}),'井封',<Text>（1）除必要的开口外井道应当完全封闭；当建筑物中不要求井道在火灾情况下具有防止火焰蔓延的功能时，允许采用部分封闭井道，但在人员可正常接近电梯处应当
                        设置无孔的高度足够的围壁，以防止人员遭受电梯运动部件直接危害，或者用手持物体触及井道中的电梯设备</Text>, 'C',0,'',1,'井道封闭',3,'井道及相关设备'),
            crtIofRssC([crtRss('全压缓冲',<Text>（1）当对重完全压在缓冲器上时，应当同时满足以下条件：<br/>①轿厢导轨提供不小于0.1+0.035v2（m）的进一步制导行程；<br/>②轿顶可以站人的最高面积的水平面与
                    位于轿厢投影部分井道顶最低部件的水平面之间的自由 垂直距离不小于1.0+0.035v2（m）；<br/>
                    ③井道顶的最低部件与轿顶设备的最高部件之间的间距(不包括导靴、钢丝绳附件等)不小于0.3+0.035v２（m）,与导靴或滚轮、曳引绳附件、垂直滑动门的横梁或部件的最高部分之间 的间距不小于0.1 +0.035v2（m）；<br/>
                    ④轿顶上方应当有一个不小于0.5m×0.6m×0.8m的空间（任意平面朝下即可）。 <br/>
                    注A-4：当采用减行程缓冲器并且对电梯驱动主机正常减速进行有效监控时，0.035v2可以用下值代替：<br/>
                    ①电梯额定速度不大于4m/s时，可以减少到1/2，但是不小于0.25m；<br/>②电梯额定速度大于4m/s时，可以减少到1/3，但是不小于0.28m。
                    <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/Headspace`}>
                        <Text variant="h4" css={{"@media print": {display: 'none'}}}>附录B 当对重压实缓冲器时，顶部空间数据的测量记录</Text>
                    </RouterLink>
                </Text>,
                        '(1)当对重完全压在缓冲器上时应当同时满足的条件。注：A1：制导行程；A2：站人距离；A3：井道顶与轿顶设备最高部件间距；A4：井道顶与导靴、曳引绳附件等最高部分间距'),
                crtRss('制导程',<Text>（2）当轿厢完全压在缓冲器上时，对重导轨有不小于0.1+0.035v2（m）的制导行程。
                        <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationRoom`}>
                            <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                        </RouterLink>
                    </Text>, '(2)对重导轨制导行程'),
            ], '顶空', null, 'C', crtSpan(2,2,0,{bH:-1}),0,0, '', 2, '曳引驱动电梯井道顶部空间',),
        ],'B','2.9限速器-3.2曳引驱动电梯井道顶部空间');
    pushItems(ari,'3.4',
        [crtIofRss([crtRss('门设',<Text>（1）当相邻两层门地坎的间距大于11m时，其间应当设置高度不小于1.80m、宽度不小于0.35m的井道安全门（使用轿厢安全门时除外）；
                        <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationRoom`}>
                            <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                        </RouterLink>
                   </Text>,'(1)安全门设置'),
                crtRss('门方向',<Text>（2）不得向井道内开启；</Text>,'(2)门的开启方向'),
                crtRss('门锁',<Text>（3）门上应当装设用钥匙开启的锁，当门开启后不用钥匙能够将其关闭和锁住，在门锁住后，不用钥匙能够从井道内将门打开；</Text>,'(3)门锁'),
                crtRss('门电安',<Text>（4）应当设置电气安全装置以验证门的关闭状态。</Text>,'(4)电气安全装置'),
            ], '安全门',null,undefined,0,'',4,'井道安全门',),
            crtIofRss([crtRss('检门尺寸',<Text>（1）高度不小于1.40m，宽度不小于0.60m；
                            <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationRoom`}>
                                <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                            </RouterLink>
                      </Text>, '(1)门的尺寸'),
                crtRss('检门方',<Text>（2）不得向井道内开启；</Text>, '(2)门的开启方向'),
                crtRss('检门锁',<Text>（3）应当装设用钥匙开启的锁，当门开启后不用钥匙能够将其关闭和锁住，在门锁住后，不用钥匙也能够从井道内将门打开；</Text>, '(3)门锁'),
                crtRss('检门安',<Text>（4）应当设置电气安全装置以验证门的关闭状态。</Text>, '(4)电气安全装置'),
            ], '检修门', null, undefined, 0, '', 5, '井道检修门',),
            crtIofRss([crtRss('支架数',<Text>（1）每根导轨应当至少有2个导轨支架，其间距一般不大于2.50m（如果间距大于2.50m应当有计算依据），安装于井道上、下端部的非标准长度导轨的支架数量应当满足设计要求；
                                    </Text>, '(1)支架个数与间距'),
                crtRss('支架',<Text>（2）导轨支架应当安装牢固，焊接支架的焊缝满足设计要求，锚栓（如膨胀螺栓）固定只能在井道壁的混凝土构件上使用；</Text>, '(2)支架安装'),
                crtRss('铅垂度',<Text>（3）每列导轨工作面每5m铅垂线测量值间的相对最大偏差，轿厢导轨和设有安全钳的T型对重导轨不大于1.2mm，不设安全钳的T型对重导轨不大于2.0mm；</Text>, '(3)导轨工作面铅垂度'),
                crtRss('顶偏差',<Text>（4）两列导轨顶面的距离偏差，轿厢导轨为0～+2mm，对重导轨为0～+3mm。
                        <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/GuideRail`}>
                            <Text variant="h4" css={{"@media print": {display: 'none'}}}>附录A 电梯导轨检验记录</Text>
                        </RouterLink>
                    </Text>, '(4)导轨顶面距离偏差'),
            ], '导轨', null, undefined, 0, '', 6, '导轨',),
            crtIofC(crtSpan(1,1,0,{bH:3}),'厢井距',<Text>（1）轿厢与面对轿厢入口的井道壁的间距不大于0.15m，对于局部高度小于0.50m或者采用垂直滑动门的载货电梯，该间距可以增加到0.20m。
                            如果轿厢装有机械锁紧的门并且门只能在开锁区内打开时，则上述间距不受限制。
                    <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationRoom`}>
                        <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                    </RouterLink>
                </Text>, 'B',0,'',7,'轿厢与井道壁距离',),
            crtIof(crtSpan(1,1,0,{bH:3}),'坎下井壁',<Text>（1）每个层门地坎下的井道壁应当符合以下要求：形成一个与层门地坎直接连接的连续垂直表面，由光滑而坚硬的材料构成（如金属薄板）；
                     其高度不小于开锁区域的一半加上50mm，宽度不小于门入口的净宽度两边各加25mm。
                <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationSheet`}>
                    <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                </RouterLink>
            </Text>, 0,'',8,'层门地坎下端井道壁'),
        ],'C','3.4井道安全门-3.8层门地坎下端井道壁');
    pushItems(ari,'3.9',
        [crtIofRss([crtRss('对重护',<Text>（1）对重（平衡重）的运行区域应当采用刚性隔障保护，该隔障从底坑地面上不大于0.30m处，向上延伸到离底坑地面至少2.50m的高度，宽度应当至少等于对重（平衡重）宽度两边各加0.10m；
                    </Text>,'(1)对重(平衡重)运行区域防护'),
                crtRss('多台间',<Text>（2）在装有多台电梯的井道中，不同电梯的运动部件之间应当设置隔障，隔障应当至少从轿厢、对重（平衡重）行程的最低点延伸到最低层站楼面以上2.50m高度，并且有足够的宽度以防止人员从一个底坑通往另一个底坑，
                        如果轿厢顶部边缘和相邻电梯的运动部件之间的水平距离小于0.50m，隔障应当贯穿整个井道，宽度至少等于运动部件或者运动部件的需要保护部分的宽度每边各加0.10m
                        <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationSheet`}>
                            <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                        </RouterLink>
                  </Text>,'(2)多台电梯运动部件之间防护'),
            ], '内防护',null,undefined,0,'',9,'井道内防护',),
            crtIofC(crtSpan(1,1,0,{bH:1}),'极限开关',<Text>（1）井道上下两端应当装设极限开关，该开关在轿厢或者对重（如果有）接触缓冲器前起作用，并且在缓冲器被压缩期间保持其动作状态
                        </Text>, 'B',0,'',10,'极限开关',),
            crtIof(crtSpan(1,1,0,{bH:3}),'井照明',<Text>（1）井道应当装设永久性电气照明。对于部分封闭井道，如果井道附近有足够的电气照明，井道内可以不设照明
                        </Text>, 0,'',11,'井道照明'),
            crtIofRssC([crtRss('坑底',<Text>（1）底坑底部应当光滑平整，不得渗水、漏水；</Text>, '(1)底坑底部'),
                crtRss('坑进入',<Text>（2）如果没有其他通道，应当在底坑内设置一个从层门进入底坑的永久性装置（如梯子），该装置不得凸入电梯的运行空间；</Text>, '(2)进入底坑的装置'),
                crtRss('坑停止',<Text>（3）底坑内应当设置在进入底坑时和底坑地面上均能方便操作的停止装置，停止装置的操作装置为双稳态、红色、标以“停止”字样，并且有防止误操作的保护；</Text>, '(3)停止装置'),
                crtRss('坑开关',<Text>（4）底坑内应当设置2P+PE型电源插座，以及在进入底坑时能方便操作的井道灯开关</Text>, '(4)电源插座与井道灯开关'),
            ], '底坑', null, undefined, crtSpan(4,4,0,{bH:-1}),undefined, 0, '', 12, '底坑设施与装置',),
            crtIofRss([crtRss('空间尺',<Text>（1）底坑中有一个不小于0.50m×0.60m×1.0m的空间（任一面朝下即可）；</Text>, '(1)底坑空间尺寸'),
                crtRss('底厢距',<Text>（2）底坑底面与轿厢最低部件的自由垂直距离不小于0.50m，当垂直滑动门的部件、护脚板和相邻井道壁之间，轿厢最低部件和导轨之间的水平距离在0.15m之内时，此垂直距离允许减少到0.10m；当轿厢
                            最低部件和导轨之间的水平距离大于0.15m但小于0.50m时，此垂直距离可按线性关系增加至0.50m；</Text>, '(2)底坑底面与轿厢部件距离'),
                crtRss('低高距',<Text>（3）底坑中固定的最高部件和轿厢最低部件之间的距离不小于0.30m。
                        <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/Pitspace`}>
                            <Text variant="h4" css={{"@media print": {display: 'none'}}}>附录C：当轿厢压实缓冲器时，底坑空间数据的测量记录</Text>
                        </RouterLink>
                    </Text>, '(3)轿厢最低部件与底坑最高部件距离'),
            ], '坑空间', <Text>轿厢完全压在缓冲器上时，底坑空间尺寸应当同时满足以下要求：</Text>, undefined, 0, '', 13, '底坑空间',),
        ],'C','3.9井道内防护-3.13底坑空间');
    pushItems(ari,'3.14',
        [crtIofRss([crtRss('张紧式',<Text>（1）限速器绳应当用张紧轮张紧，张紧轮（或者其配重）应当有导向装置；</Text>,'(1)张紧形式、导向装置'),
                 crtRss('电安张',<Text>（2）当限速器绳断裂或者过分伸长时，应当通过一个电气安全装置的作用，使电梯停止运转。</Text>,'(2)电气安全装置'),
             ], '张紧装',null,undefined,0,'',14,'限速绳张紧装置',),
            crtIofRss([crtRss('缓选型',<Text>（1）轿厢和对重的行程底部极限位置应当设置缓冲器；蓄能型缓冲器只能用于额定速度不大于1m/s的电梯，耗能型缓冲器可以用于任何额定速度的电梯；</Text>,'(1)缓冲器选型'),
                crtRss('缓标签',<Text>（2）缓冲器上应当设有铭牌，标明制造单位名称、型号、编号、技术参数和型式试验机构的名称或者标志，铭牌或者标签和型式试验证书内容应当相符；</Text>,'(2)铭牌或者标签'),
                crtRss('缓固定',<Text>（3）缓冲器应当固定可靠、无明显倾斜，并且无断裂、塑性变形、剥落、破损等现象；</Text>,'(3)固定和完好情况'),
                crtRss('缓液位',<Text>（4）耗能型缓冲器液位应当正确，有验证柱塞复位的电气安全装置。</Text>,'(4)液位和电气安全装置'),
                crtRss('撞板缓距',<Text>（5）对重缓冲器附近应当设置永久性的明显标识，标明当轿厢位于顶层端站平层位置时，对重装置撞板与其缓冲器顶面间的最大允许垂直距离；并且该垂直距离不超过最大允许值
                        <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationSheet`}>
                            <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                        </RouterLink>
                    </Text>,'(5)对重越程距离'),
            ], '缓冲器',null,undefined,0,'',15,'缓冲器',),
            crtIof(crtSpan(1,1,0,),'下空护',<Text>（1）如果井道下方有人能够到达的空间，应当将对重缓冲器安装于(或者平衡重运行区域下面是)一直延伸到坚固地面上的实心桩墩，或者在对重(平衡重)上装设安全钳
                        </Text>, 0,'',16,'井道下方空间的防护',),
            crtIofRssC([crtRss('轿检修',<Text>（1）轿顶应当装设一个易于接近的检修运行控制装置，并且符合以下要求：<br/>
                        ①由一个符合电气安全装置要求，能够防止误操作的双稳态开关（检修开关）进行操作；<br/>
                        ②一经进入检修运行时，即取消正常运行（包括任何自动门操作）、紧急电动运行、对接操作运行，只有再一次操作检修开关，才能使电梯恢复正常工作；<br/>
                        ③依靠持续揿压按钮来控制轿厢运行，此按钮有防止误操作的保护，按钮上或其近旁标出相应的运行方向；<br/>
                        ④该装置上设有一个停止装置，停止装置的操作装置为双稳态、红色、并标以“停止”字样，并且有防止误操作的保护；<br/>
                        ⑤检修运行时，安全装置仍然起作用。</Text>, '(1)检修装置'),
                crtRss('轿停止',<Text>（2）轿顶应当装设一个从入口处易于接近的停止装置，停止装置的操作装置为双稳态、红色、并标以“停止”字样，并且有防止误操作的保护。如果检修运行控制装置设在从入口处易于接近的位置，
                            该停止装置也可以设在检修运行控制装置上；</Text>, '(2)停止装置'),
                crtRss('轿插座',<Text>（3）轿顶应当装设2P+PE型电源插座。</Text>, '(3)电源插座'),
            ], '轿顶电', null, 'C', crtSpan(3,3,0,),undefined, 0, '', 1, '轿顶电气装置',4,'轿厢与对重'),
            crtIofRssC([crtRss('栏的',<Text>（1）由扶手、0.10m高的护脚板和位于护栏高度一半处的中间栏杆组成；</Text>, '(1)护栏的组成'),
                crtRss('栏扶手',<Text>（2）当护栏扶手外缘与井道壁的自由距离不大于0.85m时，扶手高度不小于0.70m，当该自由距离大于0.85m时，扶手高度不小于1.10m；</Text>, '(2)扶手高度'),
                crtRss('栏位置',<Text>（3）护栏装设在距轿顶边缘最大为0.15m之内，并且其扶手外缘和井道中的任何部件之间的水平距离不小于0.10m；
                        <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationSheet`}>
                            <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                        </RouterLink>
                    </Text>, '(3)装设位置'),
                crtRss('栏警示',<Text>（4）护栏上有关于俯伏或斜靠护栏危险的警示符号或者须知</Text>, '(4)警示标志'),
            ], '轿顶栏',<Text>井道壁离轿顶外侧边缘水平方向自由距离超过0.30m时，轿顶应当装设护栏，并且满足以下要求：</Text>,
                    'C', crtSpan(4,4,0,),undefined, 0, '', 2, '轿顶护栏',),
        ],'B','3.14限速绳张紧装置-4.2轿顶护栏');
    pushItems(ari,'4.3',
        [crtIofRss([crtRss('手动锁',<Text>（1）设有手动上锁装置，能够不用钥匙从轿厢外开启，用规定的三角钥匙从轿厢内开启；</Text>,'(1)手动上锁装置'),
                  crtRss('窗开启',<Text>（2）轿厢安全窗不能向轿厢内开启，并且开启位置不超出轿厢的边缘，轿厢安全门不能向轿厢外开启，并且出入路径没有对重（平衡重）或者固定障碍物；</Text>,'(2)安全门(窗)开启'),
                  crtRss('窗电安',<Text>（3）其锁紧由电气安全装置予以验证。</Text>,'(3)电气安全装置'),
                ], '安全窗',<Text>如果轿厢设有安全窗（门），应当符合以下要求：</Text>,undefined,0,'',3,'安全窗(门)',),
            crtIof(crtSpan(1,1,0,),'厢重距',<Text>（1）轿厢及关联部件与对重（平衡重）之间的距离应当不小于50mm
                    <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationSheet`}>
                        <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                    </RouterLink>
                </Text>, 0,'',4,'轿厢和对重(平衡重)间距',),
            crtIofRssC([crtRss('块固定',<Text>（1）对重(平衡重)块可靠固定；</Text>, '(1)固定'),
                crtRss('识别数',<Text>（2）具有能够快速识别对重(平衡重)块数量的措施(例如标明对重块的数量或者总高度)</Text>, '(2)识别数量的措施'),
            ], '对重块', null, 'B', crtSpan(2,2,0,),undefined, 0, '', 5, '对重(平衡重)块',),
            crtIofRss([crtRss('效面积',<div><Text>（1）轿厢有效面积应当符合下述规定。下述各额定载重量对应的轿厢最大有效面积允许增加不大于所列值5%的面积：</Text>
                <Table tight  miniw={800}><TableBody>
                    <TableRow>
                        <CCell>Q①</CCell><CCell>S②</CCell><CCell>Q①</CCell><CCell>S②</CCell><CCell>Q①</CCell><CCell>S②</CCell><CCell>Q①</CCell><CCell>S②</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>100</CCell><CCell>0.37</CCell><CCell>525</CCell><CCell>1.45</CCell><CCell>900</CCell><CCell>2.20</CCell><CCell>1275</CCell><CCell>2.95</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>180</CCell><CCell>0.58</CCell><CCell>600</CCell><CCell>1.60</CCell><CCell>975</CCell><CCell>2.35</CCell><CCell>1350</CCell><CCell>3.10</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>225</CCell><CCell>0.70</CCell><CCell>630</CCell><CCell>1.66</CCell><CCell>1000</CCell><CCell>2.40</CCell><CCell>1425</CCell><CCell>3.25</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>300</CCell><CCell>0.90</CCell><CCell>675</CCell><CCell>1.75</CCell><CCell>1050</CCell><CCell>2.50</CCell><CCell>1500</CCell><CCell>3.40</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>375</CCell><CCell>1.10</CCell><CCell>750</CCell><CCell>1.90</CCell><CCell>1125</CCell><CCell>2.65</CCell><CCell>1600</CCell><CCell>3.56</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>400</CCell><CCell>1.17</CCell><CCell>800</CCell><CCell>2.00</CCell><CCell>1200</CCell><CCell>2.80</CCell><CCell>2000</CCell><CCell>4.20</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>450</CCell><CCell>1.30</CCell><CCell>825</CCell><CCell>2.05</CCell><CCell>1250</CCell><CCell>2.90</CCell><CCell>2500</CCell><CCell>5.00</CCell>
                    </TableRow>
                </TableBody></Table>
                <Text>对于汽车电梯，额定载重量应当按照单位轿厢面积不小于200kg/㎡计算。注A-5：①额定重量，Kg；②轿厢最大有效面积，㎡；③一人电梯最小值；④二人电梯最小值；
                    ⑤额定重量超过2500kg时，每增加100kg，面积增加0.16㎡，对于中间载重量，其面积由线性插入法确定。</Text>
                <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationSheet`}>
                    <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                </RouterLink>
            </div>,'(1)有效面积'),
                crtRss('超面积',<Text>（2）对于为了满足使用要求而轿厢面积超出上述规定的载货电梯，必须满足以下条件：<br/>
                    ①在从层站装卸区域总可看见的位置上设置标志，表明该载货电梯的额定载重量；<br/>
                    ②该电梯专用于运送特定轻质货物，其体积可保证在装满轿厢情况下，该货物的总质量不会超过额定载重量；<br/>
                    ③该电梯由专职司机操作，并严格限制人员进入</Text>,'(2)轿厢超面积载货电梯的控制条件'),
            ], '厢面积',null,undefined,0,'',6,'轿厢面积',),
            crtIofRss([crtRss('轿铭牌',<Text>（1）轿厢内应当设置铭牌，标明额定载重量及乘客人数(载货电梯只标载重量)、制造单位名称或者商标；改造后的电梯，铭牌上应当标明额定载重量及乘客
                                人数(载货电梯只标载重量)、改造单位名称、改造竣工日期等；</Text>,'(1)铭牌'),
                crtRss('层按钮',<Text>（2）设有IC卡系统的电梯，轿厢内的出口层选层按钮应当采用凸起的星形图案予以标识，或者采用比其他按钮明显凸起的绿色按钮</Text>,'(2)出口层选层按钮标识'),
            ], '轿铭标',null,undefined,0,'',7,'轿厢内铭牌和标识',),
            crtIofRssC([crtRss('急照明',<Text>（1）正常照明电源中断时，能够自动接通紧急照明电源；</Text>, '(1)紧急照明'),
                    crtRss('报警',<Text>（2）紧急报警装置采用对讲系统以便与救援服务持续联系，当电梯行程大于30m时，在轿厢和机房（或者紧急操作地点）之间也设置对讲系统，紧急报警装置的供电来自本条（1）所述的
                        紧急照明电源或者等效电源；在启动对讲系统后，被困乘客不必再做其他操作</Text>, '(2)紧急报警装置'),
                ], '紧急照明',<Text>轿厢内应当装设符合下述要求的紧急报警装置和紧急照明：</Text>,
                'B', crtSpan(2,2,0,),undefined, 0, '', 8, '紧急照明和报警装置',),
        ],'C','4.3安全窗(门)-4.8紧急照明和报警装置');
    pushItems(ari,'4.9',
        [crtIof(crtSpan(1,1,0,{bH:1}),'地脚',<Text>（1）轿厢地坎下应当装设护脚板，其垂直部分的高度不小于0.75m，宽度不小于层站入口宽度。
                        <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationSheet`}>
                            <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                        </RouterLink>
                    </Text>, 0,'',9,'地坎护脚板'),
            crtIof(crtSpan(1,1,0,),'超载',<Text>（1）设置当轿厢内的载荷超过额定载重量时，能够发出警示信号，并且使轿厢不能运行的超载保护装置。该装置最迟在轿厢内的载荷达到110％额定载重量(对于
                        额定载重量小于750kg的电梯，最迟在超载量达到75kg)时动作，防止电梯正常启动及再平层，并且轿内有音响或者发光信号提示，动力驱动的自动门完全打开，手动门保持在未锁状态
                    </Text>, 0,'',10,'超载保护装置'),
            crtIofRssC([crtRss('钳铭牌',<Text>（1）安全钳上应当设有铭牌，标明制造单位名称、型号、编号、技术参数和型式试验机构的名称或者标志，铭牌和型式试验证书、调试证书内容应当相符；
                            </Text>, '(1)铭牌'),
                crtRss('钳电安',<Text>（2）轿厢上应当装设一个在轿厢安全钳动作以前或者同时动作的电气安全装置</Text>, '(2)电气安全装置'),
            ], '安全钳', null, 'B', crtSpan(2,2,0,{bH:-1}),undefined, 0, '', 11, '安全钳',),
            crtIof(crtSpan(1,1,0,{bH:0}),'磨损断',<div><Text>出现下列情况之一时，悬挂钢丝绳和补偿钢丝绳应当报废：<br/>
                    ①出现笼状畸变、绳股挤出、扭结、部分压扁、弯折；<br/>②一个捻距内出现的断丝数大于下表列出的数值时：</Text>
                <Table tight  miniw={800}><TableBody>
                    <TableRow>
                        <CCell rowSpan={2}>断丝的形式</CCell><CCell colSpan={3}>钢丝绳的类型</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>6×19</CCell><CCell>8×19</CCell><CCell>9×19</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>均布在外层绳股上</CCell><CCell>24</CCell><CCell>30</CCell><CCell>34</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>集中在一或者两根外层绳股上</CCell><CCell>8</CCell><CCell>10</CCell><CCell>11</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>一根外绳股上相邻的断丝</CCell><CCell>4</CCell><CCell>4</CCell><CCell>4</CCell>
                    </TableRow>
                    <TableRow>
                        <CCell>绳谷（缝）断丝</CCell><CCell>1</CCell><CCell>1</CCell><CCell>1</CCell>
                    </TableRow>
                    <TableRow>
                       <CCell colSpan={4}>注：上述断丝数参考长度为一个捻距，约为6d（d表示钢丝绳的公称直径，mm）</CCell>
                    </TableRow>
                </TableBody></Table>
                <Text>③钢丝绳直径小于其公称直径的90%；<br/>④钢丝绳严重锈蚀，铁锈填满绳股间隙。<br/>
                        采用其他类型悬挂装置的，悬挂装置的磨损、变形等不得超过制造单位设定的报废指标</Text>
                <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/ObservationSheet`}>
                    <Text variant="h4" css={{"@media print": {display: 'none'}}}>八、观测数据及测量结果记录</Text>
                </RouterLink>
            </div>, 0,'',1,'悬挂装置、补偿装置的磨损、断丝、变形等情况',5,'悬挂装置、补偿装置及旋转部件防护'),
            crtIof(crtSpan(1,1,0,{bH:4}),'端固定',<Text>（1）悬挂钢丝绳绳端固定应当可靠，弹簧、螺母、开口销等连接部件无缺损。采用其他类型悬挂装置的，其端部固定应当符合制造单位的规定。
                            </Text>, 0,'',2,'绳端固定'),
            crtIofRssC([crtRss('补固定',<Text>（1）补偿绳（链）端固定应当可靠；</Text>, '(1)绳(链)端固定'),
                crtRss('补电安',<Text>（2）应当使用电气安全装置来检查补偿绳的最小张紧位置；</Text>, '(2)电气安全装置'),
                crtRss('绳防跳',<Text>（3）当电梯的额定速度大于3.5m/s时，还应当设置补偿绳防跳装置，该装置动作时应当有一个电气安全装置使电梯驱动主机停止运转。</Text>, '(3)补偿绳防跳装置'),
            ], '补偿装', null, undefined,crtSpan(3,3,0,{bH:-1}),undefined, 0, '', 3, '补偿装置',),
            crtIofC(crtSpan(1,1,0,{bH:4}),'松绳保',<Text>（1）如果轿厢悬挂在两根钢丝绳或者链条上，则应当设置检查绳(链)松弛的电气安全装置，当其中一根钢丝绳(链条)发生异常相对伸长时，
                    电梯应当停止运行</Text>, 'B',0,'',5,'松绳(链)保护',),
        ],'C','4.9地坎护脚板-5.5松绳(链)保护');
    pushItems(ari,'5.6',
        [crtIof(crtSpan(1,1,0,),'旋转件',<Text>（1）在机房（机器设备间）内的曳引轮、滑轮、链轮、限速器，在井道内的曳引轮、滑轮、链轮、限速器及张紧轮、补偿绳张紧轮，在轿厢
                    上的滑轮、链轮等与钢丝绳、链条形成传动的旋转部件，均应当设置防护装置，以避免人身伤害、钢丝绳或链条因松弛而脱离绳槽或链轮、异物进入绳与绳槽或链与链轮之间；<br/>
                    对于允许按照GB 7588—1995及更早期标准生产的电梯，可以按照以下要求检验：<br/>
                    ①采用悬臂式曳引轮或者链轮时，有防止钢丝绳脱离绳槽或者链条脱离链轮的装置，并且当驱动主机不装设在井道上部时，有防止异物进入绳与绳槽之间或者链条与链轮之间的装置；<br/>
                    ②井道内的导向滑轮、曳引轮、轿架上固定的反绳轮和补偿绳张紧轮，有防止钢丝绳脱离绳槽和进入异物的防护装置</Text>, 0,'',6,'旋转部件的防护'),
            crtIof(crtSpan(1,1,0,),'门地坎距',<Text>（1）轿厢地坎与层门地坎的水平距离不得大于35mm。
                        <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/Gap`}>
                            <Text variant="h4" css={{"@media print": {display: 'none'}}}>附录D 电梯层门间隙、门锁啮合深度等检验记录</Text>
                        </RouterLink>
                    </Text>, 0,'',1,'门地坎距离',6,'轿门与层门'),
            crtIof(crtSpan(1,1,0,),'门标识',<Text>（1）层门和玻璃轿门上设有标识，标明制造单位名称、型号，并且与型式试验证书内容相符</Text>, 0,'',2,'门标识',),
            crtIofRss([crtRss('门扇间',<Text>（1）门扇之间及门扇与立柱、门楣和地坎之间的间隙，对于乘客电梯不大于6mm；对于载货电梯不大于8mm，使用过程中由于磨损，允许达到10mm；
                            <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/Gap`}>
                                <Text variant="h4" css={{"@media print": {display: 'none'}}}>附录D 电梯层门间隙、门锁啮合深度等检验记录</Text>
                            </RouterLink>
                       </Text>, '(1)门扇间隙'),
                    crtRss('最不利',<Text>（2）在水平移动门和折叠门主动门扇的开启方向，以150N的人力施加在一个最不利的点，前条所述的间隙允许增大，但对于旁开门不大于30mm，对于中分门其总和不大于45mm
                                </Text>, '(2)人力施加在最不利点时间隙'),
                ], '门间隙', <Text>门关闭后，应当符合以下要求：</Text>, undefined, 0, '', 3, '门间隙',),
            crtIof(crtSpan(1,1,0,),'玻璃门',<Text>（1）层门和轿门采用玻璃门时，应当有防止儿童的手被拖曳的措施</Text>, 0,'',4,'玻璃门防拖曳措施',),
            crtIofC(crtSpan(1,1,0,),'门夹人',<Text>（1）动力驱动的自动水平滑动门应当设置防止门夹人的保护装置，当人员通过层门入口被正在关闭的门扇撞击或者将被撞击时，该装置应当自动使门重新开启
                        </Text>, 'B',0,'',5,'防止门夹人的保护装置',),
            crtIofC(crtSpan(1,1,0,),'门运行',<Text>（1）层门和轿门正常运行时不得出现脱轨、机械卡阻或者在行程终端时错位；由于磨损、锈蚀或者火灾可能造成层门导向装置失效时，应当设置应急导向装置，
                        使层门保持在原有位置</Text>, 'B',0,'',6,'门的运行与导向',),
            crtIofC(crtSpan(1,1,0,),'关层门',<Text>（1）在轿门驱动层门的情况下，当轿厢在开锁区域之外时，如果层门开启（无论何种原因），应当有一种装置能够确保该层门自动关闭。自动关闭装置采用重块时，
                        应当有防止重块坠落的措施</Text>, 'B',0,'',7,'自动关闭层门装置',),
            crtIofC(crtSpan(1,1,0,),'急开锁',<Text>（1）每个层门均应当能够被一把符合要求的钥匙从外面开启；紧急开锁后，在层门闭合时门锁装置不应当保持开锁位置</Text>,
                        'B',0,'',8,'紧急开锁装置',),
        ],'C','5.6旋转部件的防护-6.8紧急开锁装置');
    pushItems(ari,'6.9',
        [crtIofRss([crtRss('层门锁',<Text>(1)每个层门都应当设有符合下述要求的门锁装置： <br/>①门锁装置上设有铭牌，标明制造单位名称、型号和型式试验机构的名称或者标志，铭牌和型式试验证书内容相符； <br/>②锁紧动作由重力、
                        永久磁铁或者弹簧来产生和保持，即使永久磁铁或者弹簧失效，重力亦不能导致开锁； <br/>③轿厢在锁紧元件啮合不小于7mm时才能启动； <br/>④门的锁紧由一个电气安全装置来验证，该装置由锁紧元件强制操作而没有任何中间机构，并且能够
                        防止误动作；</Text>, '(1)层门门锁装置'),
                crtRss('轿门锁',<Text>（2）如果轿门采用了门锁装置，该装置应当符合本条(1)的要求；
                        <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/Gap`}>
                            <Text variant="h4" css={{"@media print": {display: 'none'}}}>附录D 电梯层门间隙、门锁啮合深度等检验记录</Text>
                        </RouterLink>
                    </Text>, '(2)轿门门锁装置'),
             ], '锁紧',null, undefined, 0, '', 9, '门的锁紧',),
             crtIofRss([crtRss('门联锁',<Text>（1）正常运行时应当不能打开层门，除非轿厢在该层门的开锁区域内停止或停站；如果一个层门或者轿门（或者多扇门中的任何一扇门）开着，在正常操作情况下，应当不能启动电梯或者
                                    不能保持继续运行；</Text>, '(1)机电联锁'),
                crtRss('门闭电',<Text>（2）每个层门和轿门的闭合都应当由电气安全装置来验证，如果滑动门是由数个间接机械连接的门扇组成，则未被锁住的门扇上也应当设置电气安全装置以验证其闭合状态
                            </Text>, '(2)电气安全装置'),
              ], '门闭合',null, undefined, 0, '', 10, '门的闭合',),
            crtIofRss([crtRss('门限装',<Text>（1）应当设置轿门开门限制装置，当轿厢停在开锁区域外时，能够防止轿厢内的人员打开轿门离开轿厢；</Text>, '(1)轿门开门限制装置'),
                crtRss('开门',<Text>（2）在轿厢意外移动保护装置允许的最大制停距离范围内，打开对应的层门后，能够不用工具(三角钥匙或者永久性设置在现场的工具除外)从层站处打开轿门</Text>, '(2)轿门的开启'),
            ], '开门限',null, undefined, 0, '', 11, '轿门开门限制装置及轿门的开启',),
            crtIofC(crtSpan(1,1,0,),'门刀',<Text>（1）轿门门刀与层门地坎，层门锁滚轮与轿厢地坎的间隙应当不小于5mm；电梯运行时不得互相碰擦
                        <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/Gap`}>
                            <Text variant="h4" css={{"@media print": {display: 'none'}}}>附录D 电梯层门间隙、门锁啮合深度等检验记录</Text>
                        </RouterLink>
                    </Text>, 'C',0,'',12,'门刀、门锁滚轮与地坎间隙',),
            crtIof(crtSpan(1,1,0,),'平衡系',<Text>（1）曳引电梯的平衡系数应当在0.40～0.50之间，或者符合制造（改造）单位的设计值
                    <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/Equilibrium`}>
                        <Text variant="h4" css={{"@media print": {display: 'none'}}}>附录E 8.1B平衡系数试验和8.8C电梯速度检验记录</Text>
                    </RouterLink>
                </Text>, 0,'',1,'平衡系数试验',8,'试验'),
            crtIofC(crtSpan(1,1,0,),'上速保装',<Text>（1）当轿厢上行速度失控时，轿厢上行超速保护装置应当动作，使轿厢制停或者至少使其速度降低至对重缓冲器的设计范围；该装置动作时，应当使一个电气安全装置动作
                            </Text>, 'C',0,'',2,'轿厢上行超速保护装置试验',),
        ],'B','6.9门的锁紧-8.2轿厢上行超速保护装置试验');
    pushItems(ari,'8.3',
        [crtIofRss([crtRss('制停',<Text>（1）轿厢在井道上部空载，以型式试验证书所给出的试验速度上行并触发制停部件，仅使用制停部件能够使电梯停止，轿厢的移动距离在型式试验证书给出的范围内；
                    </Text>, '(1)制停情况'),
                   crtRss('自监测',<Text>（2）如果电梯采用存在内部冗余的制动器作为制停部件，则当制动器提起(或者释放)失效，或者制动力不足时，应当关闭轿门和层门，并且防止电梯的正常启动</Text>, '(2)自监测功能'),
                ], '移动保',null, undefined, 0, '', 3, '轿厢意外移动保护装置试验',),
            crtIof(crtSpan(1,1,0,),'钳试验',<Text>（1）施工监督检验：轿厢装有下述载荷，以检修速度下行，进行限速器-安全钳联动试验，限速器－安全钳动作应当可靠:<br/>①瞬时式安全钳，轿厢装载额定载重量，对于
                    轿厢面积超出规定的载货电梯，以轿厢实际面积按规定所对应的额定载重量作为试验载荷；<br/>②渐进式安全钳：轿厢装载125%额定载重量；对于轿厢面积超出规定的载货电梯，取125%额定载重量与轿厢实际面积按规定所对应的额定载重量
                    两者中的较大值作为试验载荷；对于额定载重量按照单位轿厢有效面积不小于200kg/m2计算的汽车电梯，轿厢装载150%额定载重量
                    </Text>, 0,'',4,'轿厢限速器－安全钳试验',),
            crtIof(crtSpan(1,1,0,),'对限速器',<Text>（1）轿厢空载，以检修速度上行，进行限速器-安全钳联动试验，限速器－安全钳动作应当可靠</Text>,
                    0,'',5,'对重(平衡重)限速器—安全钳试验',),
            crtIofC(crtSpan(1,1,0,),'运行试',<Text>（1）轿厢分别空载、满载，以正常运行速度上、下运行，呼梯、楼层显示等信号系统功能有效、指示正确、动作无误，轿厢平层良好，无异常现象发生；对于设有IC卡系统
                        的电梯，轿厢内的人员无需通过IC卡系统即可到达建筑物的出口层，并且在电梯退出正常服务时，自动退出IC卡功能</Text>, 'C',0,'',6,'运行试验',),
            crtIofRss([crtRss('救程序',<Text>（1）在机房内或者紧急操作和动态测试装置上设有明晰的应急救援程序；</Text>, '(1)救援程序'),
                crtRss('救通道',<Text>（2）建筑物内的救援通道保持通畅，以便相关人员无阻碍地抵达实施紧急操作的位置和层站等处；</Text>, '(2)救援通道'),
                crtRss('救援',<Text>（3）在各种载荷工况下，按照本条(1)所述的应急救援程序实施操作，能够安全、及时地解救被困人员</Text>, '(3)救援操作'),
            ], '急救',null, undefined, 0, '', 7, '应急救援试验',),
            crtIofC(crtSpan(1,1,0,),'梯速',<Text>（1）当电源为额定频率，电动机施以额定电压时，轿厢承载50%额定载重量，向下运行至行程中段（除去加速和减速段）时的速度，
                        不得大于额定速度的105%，不宜小于 额定速度的92%
                    <RouterLink href={`/report/EL-JJ/ver/${verId}/${repId}/Equilibrium`}>
                        <Text variant="h4" css={{"@media print": {display: 'none'}}}>附录E 8.1B平衡系数试验和8.8C电梯速度检验记录</Text>
                    </RouterLink>
                </Text>, 'C',0,'',8,'电梯速度',),
        ],'B','8.3门的锁紧-8.8轿厢上行超速保护装置试验');
    pushItems(ari,'8.9',
        [crtIof(crtSpan(1,1,0,),'空载曳',<Text>（1）当对重压在缓冲器上而曳引机按电梯上行方向旋转时，应当不能提升空载轿厢</Text>, 0,'',9,'空载曳引检查',),
            crtIof(crtSpan(1,1,0,),'上制动',<Text>（1）轿厢空载以正常运行速度上行至行程上部，切断电动机与制动器供电，轿厢应当完全停止</Text>,
                        0,'',10,'上行制动工况曳引检查',),
            crtIofC(crtSpan(1,1,0,),'下制动',<Text>（1）轿厢装载125%额定载重量，以正常运行速度下行至行程下部，切断电动机与制动器供电，轿厢应当完全停止</Text>,
                    'A',0,'',11,'下行制动工况曳引检查',),
            crtIofC(crtSpan(1,1,0,),'静态曳',<Text>（1）对于轿厢面积超过规定的载货电梯，以轿厢实际面积所对应的125%额定载重量进行静态曳引试验；对于额定载重量按照单位轿厢有效面积不小于200kg/ m2计算
                    的汽车电梯，以150%额定载重量做静态曳引试验；历时10min，曳引绳应当没有打滑现象</Text>, 'A',0,'',12,'静态曳引试验',),
            crtIofC(crtSpan(1,1,0,),'制动试',<Text>（1）轿厢装载125%额定载重量，以正常运行速度下行时，切断电动机和制动器供电，制动器应当能够使驱动主机停止运转，试验后轿厢应无明显变形和损坏
                        </Text>, 'A',0,'',13,'制动试验',),
            crtIof(crtSpan(1,1,0,),'视频',<Text>（1） 公众聚集场所的电梯和住宅小区的电梯，应当配备符合有关规定和标准的视频监控设施。</Text>, 0,'',1,'视频监控设施',9,'其他'),
            crtIof(crtSpan(1,1,0,),'远程监',<Text>（2）新安装的乘客电梯应当配备能够实现远程监测功能的装置，并提供标准数据接口。</Text>, 0,'',2,'远程监测装置',),
            crtIof(crtSpan(1,1,0,),'降温',<Text>（3）采取在机房安装空调等通风降温措施，保证电梯机房内温度符合相关标准要求。</Text>, 0,'',3,'机房通风降温措施',),
        ],'B','8.9空载曳引检查-9.3机房通风降温措施');

    return { Item: ari, } as { [key: string]: any[] };
};

